
var flag_info = [
{"continent":"Africa","country":"Algeria","capital":"Algiers","info":"The flag's design is derived from the standard of Emir Abdel Kadir in the 19th century which consisted of two equal vertical bands, green and white, as well as being inspired from the flag of the Algerian Regency from the 16th to the 19th century, which consisted of a white crescent and star on a red background (the same as the modern flag of Turkey; the Algerian Regency was an autonomous vassal of the Ottoman Empire). However, for the most part its history is unclear.","infoTwo":"It is also believed to be based on a flag created in 1928 by Messali Hadj, a nationalist leader. White, green and red, along with the star and crescent have been used historically in Islamic countries. The white color represents peace; the green represents Islam; the red, the blood of those killed fighting for independence in the Algerian War (1954 to 1962) and the star and crescent represent Islam."},
{"continent":"Africa","country":"Angola","capital":"Luanda","info":"The national flag of Angola came into use at independence on November 11, 1975. It is split horizontally into an upper red half and a lower black half, and features a yellow half-gear crossed with a machete and crowned with a star. Later the explanation was made less party-specific: The red is for the blood spilt by Angolans during their independence struggles, while the black is for the continent of Africa. The symbol in the middle is of a crossed cog wheel (representing workers and industry) and machete (representing the peasantry, agricultural production and the armed struggle) with a gold star.","infoTwo":"It was adopted during a time when Angola had a Marxist government, and thus was supposed to evoke the image of the hammer and sickle found on the flag of the former Soviet Union, a common symbol of Communism. The flag is most recently described and explained in article 162 of the Constitutional Law of the Republic of Angola (Constitution) of August 25, 1992."},
{"continent":"Africa","country":"Benin","capital":"Porto-Novo","info":"The national flag of Benin is a flag consisting of two horizontal yellow and red bands on the fly side and a green vertical band at the hoist. Adopted in 1959 to replace the French Tricolour, it was the flag of the Republic of Dahomey until 1975, when the People's Republic of Benin was established. The new regime renamed the country and changed the flag to a green field with a red star in the canton. This version was utilized until the regime collapsed in 1990, coinciding with the Revolutions of 1989. The new government promptly restored the original pre-1975 flag. The colours of the flag carry cultural, political, and regional meanings. Nationally, the yellow and green allude to the northern savannas and palm groves located in the south of the country, while the red symbolizes the blood shed by those who fought for Dahomey. On a continental level, the yellow, green and red represented the Pan-Africanist movement; the three colours were utilized by the African Democratic Rally, a political party representing the interests of French West Africa in the National Assembly of France at the time of decolonization. Furthermore, the colours are the same as the ones utilized in the flag of Ethiopia. This honours the oldest independent country in Africa and the only nation other than Liberia to remain independent during the Scramble for Africa.","infoTwo":"The colours of the flag carry cultural, political, and regional meanings. Nationally, the yellow and green allude to the northern savannas and palm groves located in the south of the country, while the red symbolizes the blood shed by those who fought for Dahomey. On a continental level, the yellow, green and red represented the Pan-Africanist movement; the three colours were utilized by the African Democratic Rally, a political party representing the interests of French West Africa in the National Assembly of France at the time of decolonization. Furthermore, the colours are the same as the ones utilized in the flag of Ethiopia. This honours the oldest independent country in Africa and the only nation other than Liberia to remain independent during the Scramble for Africa."},
{"continent":"Africa","country":"Botswana","capital":"Gaborone","info":"The flag of Botswana is a flag consisting of a light blue field cut horizontally in the centre by a black stripe with a thin white frame. Adopted in 1966 to replace the Union Jack, it has been the flag of the Republic of Botswana since the country gained independence that year. It is one of the few African flags that utilizes neither the colours of the Pan-Africanist movement nor the colours of the country's leading political party.","infoTwo":"The colours of the flag carry cultural, political, and regional meanings. The light blue represents water—specifically, in its form of rain, as it is a precious resource in Botswana, which relies on agriculture and suffers from frequent droughts due to the dry and arid climate of the Kalahari Desert. The blue also alludes to the motto featured on the coat of arms of Botswana—Pula, which means "},
{"continent":"Africa","country":"Burkina Faso","capital":"Ouagadougou","info":"The flag of Burkina Faso is formed by two equal horizontal bands of red (top) and green, with a yellow five-pointed star resting in the center. The flag was adopted on 4 August 1984. The flag is coloured in the popular Pan-African colours of the Ethiopian flag, reflecting both a break with the country’s colonial past and its unity with other African ex-colonies. The red is also said to symbolize the revolution and the green the abundance of agricultural and natural riches. The yellow star placed over the red and green stripes is the guiding light of the revolution. The flag was adopted following the coup of 1983 which brought Thomas Sankara to power.","infoTwo":"From 1984 until 1997, the official Burkina Faso coat of arms used a revolutionary central crest featuring a mattock crossed with a Soviet AK-47 assault rifle, along with an open book symbolising the importance of education and the study of revolutionary principles. A lower banner declared in French, "},
{"continent":"Africa","country":"Burundi","capital":"Bujumbura","info":"The national flag of Burundi was adopted on June 28, 1967 after the country's independence from Belgium on 1 July 1962. It consists of a white saltire which divides the field into alternating red and green areas. The center of the saltire merges into a white disk, on which there are three red solid six-pointed stars outlined in green. The ratio of the flag was 2:3 until September 27, 1982. The current ratio is 3:5.","infoTwo":"The map is divided into four parts by a white cross. The upper and lower parts are red in color while the left and right ones are green in color. White color of the cross represents peace, green represents the nation's hopes placed on future development and red symbolizes the suffering of the nation during its freedom struggle. The three stars in triangular configuration stand for the three major ethnic groups of Burundi: the Hutu, the Twa and the Tutsi. The three stars also stand for the three elements of the national motto: Unité, Travail, Progrès ("},
{"continent":"Africa","country":"Cameroon","capital":"Yaoundé","info":"The national flag of Cameroon was adopted in its present form on 20 May 1975 after Cameroon became a unitary state. It is a vertical tricolor of green, red and yellow, defaced with a five-pointed star in its center. There is a wide variation in the size of the central star, although it is always contained within the inside stripe.","infoTwo":"The color scheme uses the traditional Pan-African colors (Cameroon becoming the second state to do so). The center stripe is thought to stand for unity: red is the colour of unity, and the star is referred to as "},
{"continent":"Africa","country":"Cape Verde","capital":"Praia","info":"The national flag of Cape Verde was adopted on September 22, 1992, replacing the flag adopted during Cape Verdean independence, fought for with Guinea-Bissau, another former Portuguese colony on mainland West Africa.","infoTwo":"The 10 stars on the flag represent the main islands of the nation (a chain of islands off the coast of West Africa). The blue represents the ocean and the sky. The band of white and red represents the road toward the construction of the nation, and the colours stand for peace (white) and effort (red). The yellow colour, circular formation of the stars, and dark blue field show similarity to the flag of Europe with 12 stars instead of 10, originally designed for the Council of Europe, but also used by the European Union. The stripes are in 6:1:1:1:3 ratio, and the circle of stars is centred 3/8 along the fly."},
{"continent":"Africa","country":"Central African Republic","capital":"Bangui","info":"The flag of the Central African Republic was adopted on December 1, 1958. It was designed by Barthélemy Boganda, the first president of the autonomous territory of Oubangui-Chari, who believed that ","infoTwo":"According to its official description, red symbolizes the blood of the people of the nation, the blood that was spilt in order to bring it independence, and the blood that they would spill to protect their nation. Blue represents the sky and freedom. White represents peace, and dignity. Green represents hope, and faith. Yellow represents tolerance."},
{"continent":"Africa","country":"Chad","capital":"N'Djamena","info":"The national flag of the Republic of Chad is a vertical tricolor consisting (left to right) of a blue, a yellow and a red field. Blue was substituted for green to avoid confusion with Mali. The basic design is the same as that of the flag of Romania, and the flag of Andorra. The only divergence from the flag of Romania is different variations of blue on the left strip.","infoTwo":"Blue symbolizes, officially, the sky, hope, and water; yellow the sun and the desert to the north of the country; red progress, unity, and sacrifice. Red also recalls the blood shed for independence"},
{"continent":"Africa","country":"Comoros","capital":"Moroni","info":"The current flag of the Union of Comoros was designed in 2001 and officially adopted on 7 January 2002. It continues to display the crescent and four stars, which is a motif that has been in use in slightly various forms since 1975 during the independence movement. In its constitution, the government of the Comoros refers to the insigne as L'emblème national, or the ","infoTwo":"The design consists of a white crescent with four white stars inside of a green triangle. The flag has four stripes, representing four islands of the nation: yellow is for Mohéli, white is for Mayotte (claimed by Comoros but administered by France), red is for Anjouan, and blue is for Grande Comore. The star and crescent symbol stands for Islam, which is the nation's major religion."},
{"continent":"Africa","country":"Congo","capital":"Brazzaville","info":"The flag of the Republic of the Congo is a flag consisting of a yellow diagonal band divided diagonally from the lower hoist-side corner, with a green upper triangle and red lower triangle. Adopted in 1959 to replace the French Tricolour, it was the flag of the Republic of the Congo until 1970, when the People's Republic of the Congo was established. The new regime changed the flag to a red field with the coat of arms of the People's Republic in the canton. This version was utilized until the regime collapsed in 1991. The new government promptly restored the original pre-1970 flag.","infoTwo":"The colours of the flag carry cultural, political, and regional meanings. Nationally, the green epitomizes the agriculture and forests of the Congo, while the yellow represents the "},
{"continent":"Africa","country":"Democratic Republic of Congo","capital":"Kinshasa","info":"The flag of the Democratic Republic of the Congo shows a sky blue flag, adorned with a yellow star in the upper left canton and cut diagonally by a red stripe with a thin yellow frame. It was adopted on 20 February 2006. A new constitution, ratified in December 2005 and which came into effect in February 2006, promoted a return to a flag similar to that flown between 1963 and 1971, with a change from a more royal blue to sky blue, which represents peace. Red stands for ","infoTwo":"The red symbolized the people's blood; the yellow symbolized prosperity; the blue symbolized hope; and the star represented unity. This flag was changed when the country was renamed Zaire in 1971. The Zaire flag was created as part of Mobutu's attempted re-Africanization of the nation and was used officially until Mobutu's overthrow in the First Congo War."},
{"continent":"Africa","country":"Djibouti","capital":"Djibouti","info":"The flag of Djibouti was adopted on 27 June 1977, following the country's independence from France. The light blue represents the Issa Somalis, and the green represents the Afars. The five-pointed star in its center represents the Somali-inhabited territories in Greater Somalia.","infoTwo":"The flag of Djibouti features two equal horizontal bands of blue (top) and green, with a white isosceles triangle based on the hoist side. The triangle bears a red, five-pointed star in its centre, which represents the Somali-inhabited territories in Greater Somalia. Each colour symbolizes something different; namely, the earth (green), the sea and sky ( light blue), peace (white), and unity (red). The light blue represents the Issa Somalis, and the green represents the Afar. The red star signifies the unity of the state."},
{"continent":"Africa","country":"Egypt","capital":"Cairo","info":"The flag of Egypt is a tricolour consisting of the three equal horizontal red, white, and black bands of the Arab Liberation flag dating back to the Egyptian Revolution of 1952. The flag bears Egypt's national emblem, the Eagle of Saladin centered in the white band.","infoTwo":"Whilst the Federation of Arab Republic was dissolved in 1977, Egypt retained the Federation's flag until October 4, 1984, when the black Hawk of Qureish was replaced in the white band (and on the coat of arms) by the Eagle of Saladin (the 1958 version as opposed to the 1952 version). In addition, the shade of red in the red band was restored to the slightly darker shade of the red band in the pre-Federation flag."},
{"continent":"Africa","country":"Equatorial Guinea","capital":"Malabo","info":"The flag of Equatorial Guinea was adopted on August 21, 1979. The six stars on the map represent the country's mainland and five islands. Under the rule of dictator Francisco Nguema the flag was modified and a different national anthem was used on it. After he was deposed the original flag was restored.","infoTwo":"The flag is a horizontal tricolor, with green, white and red stripes and a blue triangle at the hoist. Green symbolizes the natural resources, agriculture and jungles of the country. Blue symbolizes the sea, which connects the main country with the islands. White symbolizes peace. Red symbolizes the blood shed by the fighters for independence."},
{"continent":"Africa","country":"Eritrea","capital":"Asmara","info":"The flag of Eritrea was adopted on December 5, 1995. It bears a resemblance to the official flag of the Eritrean People's Liberation Front. The wreath with the upright olive branch symbol was derived from the 1952 flag, which had a light blue background to honour the United Nations. The green colour in the flag stands for the agriculture and livestock of the country, the blue stands for the sea, and the red for the blood lost in the fight for freedom. The proportions of the flag are 1:2.","infoTwo":"The flag is dominated by a red isosceles triangle extending from the hoist to the fly, with complementary green and blue triangles above and below the red one. In the red portion of the flag is a gold wreath encircling a gold olive branch. The CIA World Factbook 2012 points out that the shape of the red triangle mimics the shape of the country. Green stands for the agriculture and livestock of the country, blue for the sea (Red Sea), and red for the blood lost in the fight for freedom."},
{"continent":"Africa","country":"Ethiopia","capital":"Addis Ababa","info":"The current flag of Ethiopia was adopted on 31 October 1996. It conforms to the specifications set forth in Article 3 of the 1995 Constitution of Ethiopia. However, the diameter of the central disc is increased from that of the flag used from 6 February to 31 October 1996. The three traditional colours of green, yellow and red date back to Emperor Menelik (r. 1889–1913) and were first used in a flag in 1897.","infoTwo":"The current national flag and emblem were adopted after the defeat of Ethiopia's Marxist Derg regime (in power from 1974–1991). The emblem is intended to represent both the diversity and unity of the country. Blue represents peace, the star represents diversity and unity, and the sun's rays symbolise prosperity. The green recalls the land, yellow stands for peace and hope, and red is symbolic of strength."},
{"continent":"Africa","country":"Gabon","capital":"Libreville","info":"The flag of Gabon is a tricolour consisting of three horizontal green, yellow and blue bands. Adopted in 1960 to replace the previous colonial flag containing the French Tricolour at the canton, it has been the flag of the Gabonese Republic since the country gained independence that year. The design of the present flag entailed the removal the Tricolour and the widening of the yellow stripe at the centre.","infoTwo":"The colours and symbols of the flag carry cultural, political, and regional meanings. The yellow alludes to the Equator – which cuts across the country – and also symbolizes the sun. The green epitomizes the natural resources of Gabon, as well as its "},
{"continent":"Africa","country":"Gambia","capital":"Banjul","info":"The flag of the Gambia consists of three horizontal red, blue and green bands separated by two thin white fimbriations. Adopted in 1965 to replace the British Blue Ensign defaced with the arms of the Gambia Colony and Protectorate, it has been the flag of the Republic of the Gambia since the country gained independence that year. It remained unchanged throughout the Gambia's seven-year confederation with Senegal.","infoTwo":"The colours of the flag carry cultural, political, and regional meanings. The blue alludes to the Gambia River, which is the nation's key feature and is where the country derives its name from. The red evokes the sun – given the Gambia's close proximity to the Equator – as well as the savanna, while the thin white stripes represents "},
{"continent":"Africa","country":"Ghana","capital":"Accra","info":"The flag of Ghana was designed and adopted in 1957 and was flown until 1959, and then reinstated in 1966. It consists of the Pan-African colours of red, yellow, and green, in horizontal stripes, with a black five-pointed star in the centre of the gold stripe. The Ghanaian flag was the first African flag after the flag of Ethiopia to feature these colours.","infoTwo":"The black star was adopted from the flag of the Black Star Line, a shipping line incorporated by Marcus Garvey that operated from 1919 to 1922, and gives the Ghana national football team their nickname, the Black Stars. The flag was designed by Theodosia Okoh. The red represents the blood of those who died in the country's struggle for independence from the United Kingdom, the gold represents the mineral wealth of the country, the green symbolises the country's rich forests and natural wealth, and the black star is the symbol of African emancipation."},
{"continent":"Africa","country":"Guinea","capital":"Conakry","info":"The colors of the flag were adapted from those of the Rassemblement Démocratique Africain, the dominant movement at the time of independence. The colors were in turn derived from those of Ghana, which had first adopted them in 1957. Sekou Toure, the first President of Guinea, was a close associate of Kwame Nkrumah, the former president of Ghana.","infoTwo":"Red symbolizes the people's sacrifice, yellow represents the sun and the riches of the earth, and green the country's vegetation. In keeping with other flags in the region, the Pan-African movement's colours of red, yellow, and green are used. As a former French colony it may be no coincidence that the design is a tricolour. The colours of the flag from left to right are the reverse of the flag of Mali."},
{"continent":"Africa","country":"Guinea-Bissau","capital":"Bissau","info":"The flag of Guinea-Bissauwas adopted in 1973 when independence from Portugal was proclaimed. Like the former flag of Cape Verde, the flag is based on that of the Partido Africano para a Independencia da Guine e Cabo Verde (PAIGC), still the dominant party in Guinea-Bissau. The party flag was derived from that of Ghana, which first used the Pan-African combination of red, yellow, green, and black in 1957.","infoTwo":"The flag features the traditional Pan-African colors of gold, green, red, and also the Black Star of Africa. The flag's design is heavily influenced by the flag of Ghana. The colors have the same meanings: specifically, the red is for the blood of martyrs, green for forests, and gold for mineral wealth."},
{"continent":"Africa","country":"Ivory Coast","capital":"Yamoussoukro","info":"The flag of Ivory Coast features three equal vertical bands of orange (hoistside), white, and green.","infoTwo":"After independence, the Ivory Coast formed a loose alliance of West African states. The flags of these states were influenced both by the Pan-African colours first used by Ghana, and also by the model of the French Tricolour, the flag of the former colonial power. The colours chosen for the Ivory Coast's flag were also used by Niger, with which the Ivory Coast had an alliance. They were intended to symbolise the following: the orange colour stands for the land, the savannah found in the northern part and its fertility, the white represents peace, and the green represents hope and also the forest of the southern part of the country. The flag was adopted in 1959, just prior to independence."},
{"continent":"Africa","country":"Kenya","capital":"Nairobi","info":"The Kenyan flag is based on that of Kenya African National Union and was adopted in December 12, 1963 as the country's flag. The color black represents the people of the Republic of Kenya, red for the blood shed during the fight for independence, green for the country's landscape and the white fimbriation was added later to symbolize peace and honesty. The black, red, and white traditional Maasai shield and two spears symbolize the defense of all the things mentioned above.","infoTwo":"The Kenyan flag is based on the black over red over green flag ofKenya African National Union (KANU), the political party that led the fight for freedom and independence of Kenya. Upon independence, the white fimbriation, symbolizing peace and unity, and the shield were added. The meaning of the colours of the flag of Kenya match closely to those of the Pan-African flag adopted by the Universal Negro Improvement Association and African Communities League in 1920."},
{"continent":"Africa","country":"Lesotho","capital":"Maseru","info":"The current national flag of Lesotho, adopted on October 4, 2006, features a horizontal blue, white, and green tricolour with a black mokorotlo (a Basotho hat) in the centre. The design, introduced to honour the 40th anniversary of independence, is reportedly intended to reflect a peaceful orientation for the country.","infoTwo":"In 2006, a new flag was chosen from four proposed designs; all of these designs included a brown Basotho hat instead of the shield. This was subsequently changed to a black Basotho hat in order to represent Lesotho as a black nation. The bill changing the flag was approved by the National Assembly on September 18, 2006, with 84 members of parliament voting in favour of it, 18 against it, and two abstaining. It was subsequently approved by the Senate as well."},
{"continent":"Africa","country":"Liberia","capital":"Monrovia","info":"The Liberian flag bears a close resemblance to the flag of the United States, showing the ex-American slave origins of the country. The Liberian flag has similar red and white stripes, as well as a blue square with a white star in the canton. It was adopted on Friday, April 26, 1847.","infoTwo":"The eleven stripes symbolize the signatories of the Liberian Declaration of Independence, red and white symbolizing courage and moral excellence. The white star represents the freedom the ex-slaves were given, above the blue square representing the African mainland."},
{"continent":"Africa","country":"Libya","capital":"Tripoli","info":"The flag of Libya was originally introduced in 1951, following the creation of the Kingdom of Libya. The flag was designed by Omar Faiek Shennib and approved by King Idris Al Senussi who comprised the UN delegation representing the regions of Cyrenaica, Fezzan and Tripolitania at UN unification discussions. It fell out of use in 1969, but was subsequently adopted by the National Transitional Council and anti-Gaddafi forces and formally reclaimed as the country's national flag in the Libyan interim Constitutional Declaration issued on 3 August 2011, as a result of the Fall of Tripoli from the Gaddafi government in the Libyan Civil War in August 2011.","infoTwo":"This original flag of Libya is now the only flag used by the United Nations to represent Libya, according to the following UN statement: "},
{"continent":"Africa","country":"Madagascar","capital":"Antananarivo","info":"The flag of Madagascar was adopted on 14 October 1958, two years before the independence of that nation, as Madagascar prepared for a referendum on its status in the French Community.","infoTwo":"The colors of the flag represent Madagascar's history, yearning for independence, and traditional classes. Red and white were the colors of the Merina kingdom, which succumbed to France in 1896. They were used in the flag of the last Merina monarch, Queen Ranavalona III. They may indicate the ethnic origins of the Malagasy people in Southeast Asia, and are shared by the flag of Indonesia. Green was the color of the Hova, the largest class of peasant commoners, who played a significant role in anti-French agitation and the independence movement."},
{"continent":"Africa","country":"Malawi","capital":"Lilongwe","info":"The flag of Malawi was officially adopted on 6 July 1964 when the colony of Nyasaland became independent from British rule and renamed itself Malawi. The rising sun represents the dawn of hope and freedom for the continent of Africa (when the flag was created, more countries in Africa were gaining independence from European rule). The black represents the indigenous people of the continent, the red symbolizes the blood of their struggle, and the green represents nature.","infoTwo":"A new flag of Malawi was adopted on 29 July 2010, as proposed by the Democratic Progressive Party-led government. The stripes were altered from the previous flag to match the original Pan-African Flag layout, with the red stripe at the top, the black stripe in middle, and the green stripe at the bottom. The rising sun at the flag's top was replaced with a full, centered white sun representing the economic progress Malawi has made since becoming independent. The opposition United Democratic Front announced that it would challenge the legitimacy of flag change in court."},
{"continent":"Africa","country":"Mali","capital":"Bamako","info":"The flag of Mali is a tricolour with three equal vertical stripes. From the hoist (the place where the flagpole meets the flag) the colours are green, gold, and red, the pan-African colors. The flag is almost identical to the flag of Guinea, with the exception that the colors are in reverse order.","infoTwo":"The flags colors have different meanings. The green stands for fertility of the land, Gold means purity and mineral wealth and lastly red symbolizes the blood shed for independence from the French. The current flag was adopted on March 1, 1961. The original flag was adopted on April 4, 1959, when Mali joined the Mali Federation. This flag was the same, except the golden stripe had a human stick figure, a kanaga, in black, with arms raised to the sky. The figure was removed due to the opposition of Islamic fundamentalists."},
{"continent":"Africa","country":"Mauritania","capital":"Nouakchott","info":"The flag of Mauritania is the common name for the national flag of Mauritania in north-west Africa. The flag was adopted on April 1, 1959. It was introduced under the instructions of Moktar Ould Daddah, and the subsequent constitution of 22 March 1959. It is almost unique among national flags as it does not contain any of the three most common flag colours; red, white, or blue - a distinction it shares with Jamaica.","infoTwo":"The colors green and gold are considered Pan-African colors. Green is also used to symbolize Islam, and the gold for the sands of the Sahara desert. The crescent and star are symbols of Islam, which is the major religion in the nation. Some writers have also speculated that green symbolises a bright future, and growth. There is no official specification or construction sheet for the exact relative measurements of the star and crescent, although the flag's measurements are 2:3."},
{"continent":"Africa","country":"Mauritius","capital":"Port Louis","info":"The national flag of Mauritius, also known as the Four Bands and Les Quatre Bandes (French for ","infoTwo":"The flag of Mauritius consists of red, blue, yellow and green bands. Red represents the bloodshed at the time of slavery and colonisation. Blue stands for the Indian Ocean, in the middle of which Mauritius is situated. Yellow represents the new light of independence shining over the island and the golden sunshine. Green symbolizes the lush vegetation of the island."},
{"continent":"Africa","country":"Morocco","capital":"Rabat","info":"The flag of Morocco is made of a red field with a black-bordered green pentagram. Red has considerable historic significance in Morocco, proclaiming the descent of the royal Alaouite family from the Islamic prophet Muhammad via Fatima, the wife of Ali, the fourth Muslim Caliph. Red is also the color that was used by the Sheriffs of Mecca and the Imams of Yemen. From the 17th century on, when Morocco was ruled by the Alaouite Dynasty, the flags of the country were plain red. In 1915, during the reign of Mulay Yusuf, the green interlaced pentangle was added to the national flag.","infoTwo":"While Morocco was under French and Spanish control, the red flag with the seal in the center remained in use, but only inland. Its use at sea was prohibited. When independence was restored in 1956, it once again became the national flag. The red background on the Moroccan flag represents hardiness, bravery, strength and valour, while the green represent the color of Islam, five-pointed star represents the Five Pillars of Islam."},
{"continent":"Africa","country":"Mozambique","capital":"Maputo","info":"The flag of Mozambique was adopted on 1 May 1983. It includes the image of an AK-47 with a bayonet attached to the barrel and is the only national flag in the world to feature such a modern rifle. The flag is based on the flag of the Mozambican Liberation Front (FRELIMO), the leading political party in Mozambique. The FRELIMO flag, used for a brief period after the country gained its independence from Portugal, looks like the current flag but lacking the emblem, with green, black, and yellow horizontal stripes separated by white fimbriations and a red triangle in the hoist. On independence the colors were rearranged to form the national flag, in diagonals emanating from the upper hoist.","infoTwo":"Over this was a white cogwheel containing the hoe, rifle, book, and star that appear on the present flag. The flag was altered in 1983; the colors were arranged in horizontal stripes, and the star of Marxism was made larger. Proposals for a new, non-partisan flag have been introduced. Green stands for the riches of the land, the white fimbriations signify peace, black represents the African continent, yellow symbolizes the country's minerals, and red represents the struggle for independence. The rifle stands for defence and vigilance, the open book symbolizes the importance of education, the hoe represents the country's agriculture, and the star symbolizes Marxism and internationalism."},
{"continent":"Africa","country":"Namibia","capital":"Windhoek","info":"The flag of Namibia was adopted on March 21, 1990 upon independence from South Africa. The main colours were taken from the flag of the South West Africa People's Organization (SWAPO), the most important liberation movement in Namibia. That flag was adopted in 1971 and comprises diagonal stripes of blue-red-green, the most important colours of the Ovambos, the largest ethnic group in the country. The flag also represents the Democratic Turnhalle Alliance, another Namibian political party. The gold 12 pointed sun, which is similar to the national emblem of the Republic of China, represents life and energy.","infoTwo":"The chairman of the subcommittee that chose the flag—after a competition for which 850 designs were submitted—has also explained the symbolism of the flag's colours. Red represents Namibia's most important resource, its people. It refers to their heroism and their determination to build a future of equal opportunity for all. White refers to peace and unity. Green symbolises vegetation and agricultural resources. Blue represents the clear Namibian sky and the Atlantic Ocean, the country's precious water resources and rain."},
{"continent":"Africa","country":"Niger","capital":"Niamey","info":"The Flag of Niger has been the national symbol of the West African Republic of Niger since 1959, a year prior to its formal independence from France. It uses the national colors of orange, white and green, in equal horizontal bands, with an orange rondel in the center. The flag forms one of the official national symbols of the Republic of Niger, with the coat of arms of Niger, the National Anthem (","infoTwo":"A number of sources have described the symbolic intent of the flag, although official sources are silent upon this. A common interpretation is that the upper orange band represents the northern regions of the Sahara Desert (though this is sometimes said to be the Sahel), the center white band represents purity (though this is sometimes said to be the River Niger), and the lower green band represents both hope and the fertile regions of southern Niger. The orange circle in the center band is said to represent the sun or independence."},
{"continent":"Africa","country":"Nigeria","capital":"Abuja","info":"The Flag of Nigeria was designed in 1959 and first officially hoisted on October 1, 1960. The two unique sea-green bands represent the forests and abundant natural wealth of Nigeria while the white band represents peace.","infoTwo":"The national flag is an adaptation of the winning entry from Taiwo Akinkunmi in a competition held in 1959. The original submission had a red radiating sun badge in the center triptych of one white vertical with a green vertical on each side. After the badge was removed by the judges, the flag has remained unchanged. Like other countries, Nigeria has special ensigns for civil and naval vessels. Some of its states also have flags. The designer of the national flag was Michael Taiwo Akinkunmi, a twenty three-year-old student. He was studying at Norwich Technical College in England when he saw an advertisement in a newspaper that submissions were being accepted for the design of a new National flag. In 1959 Akinkunmi's design was chosen as the winner and, with adaptations, was first officially used on October 1, 1960, Nigeria's Independence Day."},
{"continent":"Africa","country":"Qatar","capital":"Doha","info":"The flag of Qatar is in the ratio of 11:28. It is maroon with a broad white serrated band (nine white points) on the hoist side. The flag was adopted just before Qatar gained independence from Britain on September 3, 1971. Qatar modified its entirely red flag with the addition of a white vertical stripe at the hoist to suit the British directive in the mid-19th century. The nine-pointed serrated edge was added to the Qatar flag in the mid-20th century and the maroon color was adopted in 1949, thus creating the modern day national flag.","infoTwo":"In 1855, Shaikh Jassim bin Mohammed Al Thani already used a flag with similar pattern and the colour red and white. The flag's colour was tinted darker by the sun. Thus the color was adopted, creating Qatar red. The flag was officially adopted on July 9, 1971, although a nearly identical flag (only differing in proportion) had been used since 1949. The white portion of the Qatar flag symbolizes peace. The maroon, which was formerly red, represents the Kharijite Muslims of Qatar and the bloodshed in Qatar's many wars. The serrated edge represents Qatar as the 9th member of the 'reconciled Emirates' of the Persian Gulf at the conclusion of the Qatari-British treaty in 1916. Qatar's flag is the only national flag having a width more than twice its height."},
{"continent":"Africa","country":"Rwanda","capital":"Kigali","info":"The flag of Rwanda was adopted on October 25, 2001. The new flag represents national unity, respect for work, heroism, and confidence in the future. It was adopted to avoid connotations to the 1994 genocide. The flag was designed by Alphonse Kirimobenecyo.","infoTwo":"The flag has four colours: blue, green, and two forms of yellow (standard yellow for the middle band and what the Pantone system calls "},
{"continent":"Africa","country":"São Tomé and Príncipe","capital":"Sao Tome","info":"The flag of São Tomé and Príncipe consists of a red triangle situated at the hoist, with three horizontal green, yellow and green bands charged with two five-pointed black stars at the centre. Adopted in 1975 to replace theflag of Portugal from the colonial period, it has been the flag of the Democratic Republic of São Tomé and Príncipe since the country gained independence in that same year. The design of the present flag was inspired by and is almost identical to the flag of the Movement for the Liberation of São Tomé and Príncipe.","infoTwo":"The colors and symbols of the flag carry cultural, political, and regional meanings. The green alludes to the plentiful vegetation of the country, while the yellow stands for the tropical sun and cocoa, a key agricultural crop for the nation. The red evokes the "},
{"continent":"Africa","country":"Senegal","capital":"Dakar","info":"The flag of Senegal is a tricolour consisting of three vertical green, yellow and red bands charged with a five-pointed green star at the centre Adopted in 1960 to replace the flag of the Mali Federation, it has been the flag of the Republic of Senegal since the country gained independence that year. The present and previous flags were inspired by French Tricolour, which flew over Senegal until 1960.","infoTwo":"In Islam, the country's majority religion at 94% percent of the population, the green of both the first stripe and the star represent the colour of the Prophet, Christians see the presence of green as a portent of hope, and Animists view green as representative of fecundity. The Senegalese government offers exegesis for the presence of yellow and red as well, yellow being "},
{"continent":"Africa","country":"Seychelles","capital":"Victoria","info":"The flag of the Seychelles was adopted on January 8, 1996. The current flag is the third used by the country since its independence from Britain on June 29, 1976. The colours used in the current flag are the official colours of two of the nation's major political parties–Seychelles People's United Party and the Seychelles Democratic Party.","infoTwo":"The flag consists of five different coloured bands (green, white, red, yellow and blue) starting from one end and diverging towards the other end. The oblique bands symbolize a dynamic new country moving into the future. The colour blue depicts the sky and the sea that surrounds the Seychelles. Yellow is for the sun which gives light and life, red symbolizes the people and their determination to work for the future in unity and love, whilst the white band represents social justice and harmony. The green depicts the land and natural environment."},
{"continent":"Africa","country":"Sierra Leone","capital":"Freetown","info":"The flag of Sierra Leone is a tricolour consisting of three horizontal green, white and blue bands. It was adopted in 1961, Sierra Leone's independence year, to replace the British Blue Ensign defaced with the arms of the crown colony. In 1960, the College of Arms formulated and then approved of a new flag and coat of arms for Sierra Leone, in anticipation of the colony's independence the following year. The arms was designed first, and its predominant colours of green, white, and blue were subsequently utilized towards the creation of the flag. It was first hoisted at midnight on April 27, 1961, the day Sierra Leone became an independent country.","infoTwo":"The colours of the flag carry cultural, political, and regional meanings. The green alludes to the country's natural resources – specifically agriculture and its mountains. – while the white epitomizes "},
{"continent":"Africa","country":"Somalia","capital":"Mogadishu","info":"The Flag of Somalia, also known as the Somali Flag, was adopted on October 12, 1954. It was designed by Mohammed Awale Liban. Upon reunification of Italian Somaliland and British Somaliland, the flag was used for the nascent Somali Republic. It was originally conceived and serves as an ethnic flag for the Somali people. The flag of Somalia was created in 1954 during the transitional trusteeship period of the nation's history. It was personally designed by the Somali scholar Mohammed Awale Liban, after he had been selected by the Somali labour trade union to come up with a design in preparation for independence.","infoTwo":"As an ethnic flag, the five-pointed white Star of Unity in its center represents the Somali ethnic group found in Djibouti, the Ogaden region in Ethiopia, the North Eastern Province in Kenya, and the former British Somaliland and Italian Somaliland territories in present-day Somalia. The Somali flag's light blue backdrop was originally influenced by the flag of the United Nations, in recognition of the UN's role in Somalia's transition to independence during the trusteeship period. However, it now officially denotes the sky as well as the Indian Ocean, which flanks the country. The flag's blazon, or heraldic description, is: Azure, a mullet Argent."},
{"continent":"Africa","country":"South Africa","capital":"Cape Town","info":"The flag of South Africa was adopted on 27 April 1994, at the beginning of South Africa's 1994 general election, to replace the flag that had been used since 1928. The new national flag, designed by State Herald Frederick Brownell, was chosen to represent the new democracy. The present South African national flag was first flown on 27 April 1994. However, the flag was first commissioned as an interim flag only, and was decided upon at the very last minute, barely making it onto the nation's flagpoles in time for the election.","infoTwo":"According to Mr. Frederick Brownell, the former State Herald who played a large role in the original design, while the colours of the flag do not have any official symbolism, they do represent a synopsis of the country’s flag history. The design in turn, represents a converging of paths, the merging of both the past and the present."},
{"continent":"Africa","country":"South Sudan","capital":"Juba","info":"The flag of South Sudan was adopted following the signing of the Comprehensive Peace Agreement that ended the Second Sudanese Civil War. The flag was previously used as the flag of the Sudan People's Liberation Movement. The horizontal black, white, red, and green bands of the flag share the same design as the Kenyan flag, and the Pan-African symbolism thereof.","infoTwo":"The Southern Sudanese government also specifies that the colours of the flag are to represent. Black if for the Black African skin. Red is blood that was shed by the liberation struggle martyrs. Green represents the country's natural resources and verdant land. White stands for peace attained after many years of the liberation struggle. Blue are the waters of the Nile River, a source of life for the country. Yellow is the unity of the states making up South Sudan."},
{"continent":"Africa","country":"Sudan","capital":"Khartoum","info":"The flag of Sudan was adopted on May 20, 1970, and consists of a horizontal red-white-black tricolor, with a green triangle at the hoist. The flag is based on the Arab Liberation Flag shared by Egypt, Iraq, Syria, and Yemen, that uses a subset of the Pan-Arab colors in which green is less significant. Prior to the 1969 military coup of Gaafar Nimeiry, a blue-yellow-green tricolor design was used.","infoTwo":"Red, white, black and green are called the pan-Arab colors and have been historically linked to the Arab people and Islamic religion for centuries. The colors stand for Arab unity and independence. The red stripe represents Sudan's struggle for independence and many other struggles, and the sacrifices of the country's martyrs. The white represents peace, light and optimism. It also represents the White Flag League which was a nationalist group that rose up against colonial rule in 1924. The black represents Sudan; in Arabic 'Sudan' means black. It also represents the black flag of nationalists who fought colonial rule during the Mahdist Revolution, late in 19th century. Green represents Islam, agriculture and the prosperity of the land."},
{"continent":"Africa","country":"Swaziland","capital":"Mata-utu","info":"The flag of Swaziland was adopted on October 6, 1968 after Swaziland gained independence from Britain on September 6, 1968. The design of the flag is based on a flag given by King Sobhuza II to the Swazi Pioneer Corps in 1941. The central focus of the flag is a shield and two spears, symbolizing protection from the country's enemies. Its colour is meant to show that white and black people live in peaceful coexistence in Swaziland.","infoTwo":"The red stands for past battles, the blue for peace and stability, and the yellow for the resources of Swaziland. The flag has four horizontal stripes - two blue strips at the top and bottom while the center stripe is red. Two thin yellow strips border the red strip in the flag. On the red strip is an ox hide combat shield from the traditional Swazi Emasotsha Regiment, laid horizontally. The shield is reinforced by a staff from which hangs injobo tassels-bunches of feathers of the widowbird and the lourie. They also decorate the shield. These feathers are used only by the king. Above the staff are two assegais-local spears, a Swazi fighting stick and three royal Swazi ornamental tassels called tinjobo, which are made from widow bird and loury feathers."},
{"continent":"Africa","country":"Tanzania","capital":"Dodoma","info":"The flag of Tanzania consists of a yellow-edged black diagonal band divided diagonally from the lower hoist-side corner, with a green upper triangle and blue lower triangle. Adopted in 1964 to replace the individual flags of Tanganyika and Zanzibar, it has been the flag of the United Republic of Tanzania since the two states merged together that year. The design of the present flag incorporates the elements from the two former flags.","infoTwo":"The colors and symbols of the flag carry cultural, political, and regional meanings. The green alludes to the natural vegetation and "},
{"continent":"Africa","country":"Togo","capital":"Lomé","info":"The flag of Togo was adopted on April 27, 1960. It has five equal horizontal bands of green (top and bottom) alternating with yellow. There is a white five-pointed star on a red square in the upper hoist-side corner. It uses the popular pan-African colors of Ethiopia, but the design resembles the flag of Liberia which itself echoes the flag of the United States. The flag was designed by artist Paul Ahyi and approximates a golden rectangle closely.","infoTwo":"Ahyi (1930 – January 4, 2010) was regarded as among the greatest of African artists of his generation. Born in Togo, Ahyi graduated from the École nationale supérieure des Beaux-Arts in Paris in 1959 and returned to Togo. He designed the flag of Togo while working on other contemporary works. The three colours - green, red and yellow - are the Pan-African colors, borrowed from the flag of Ethiopia. The red in the canton symbolizes the blood shed by the martyrs of independence which bears the white star of hope. The green bands represent each the forests, agriculture and hope of the future. The yellow bands both represent the natural resources of the land."},
{"continent":"Africa","country":"Tunisia","capital":"Tunis","info":"The red and white flag of Tunisia, adopted as national flag in 1959, has its origins the naval ensign of the Kingdom of Tunis adopted in 1831 by Al-Husayn II ibn Mahmud. The star and crescent recalls the Ottoman flag and is therefore an indication of Tunisia's history as a part of the Ottoman Empire. The current official design dates to 1999.","infoTwo":"For the Tunisian embassy in France, the color red represents the blood of martyrs killed during the Turkish conquest of Tunisia in 1574. However, the Tunisians invited the Turkish to liberate them from the Spanish invaders and from what is left of the Hafside dynasity. Another interpretation is that the "},
{"continent":"Africa","country":"Uganda","capital":"Kampala","info":"The flag of Uganda was adopted on 9 October 1962, the date that Uganda became independent from the United Kingdom. It consists of six equal horizontal bands of black (top), yellow, red, black, yellow, and red (bottom); a white disc is superimposed at the centre and depicts the national symbol, a grey crowned crane, facing the hoist side. The three colours are representative of African peoples (black), Africa's sunshine (yellow), and African brotherhood (red being the colour of blood, through which all Africans are connected).","infoTwo":"The grey crowned crane is fabled for its gentle nature and was also the military badge of Ugandan soldiers during British rule. The raised leg of the crane symbolizes the forward movement of the country. During the colonial rule the Britishers selected the flag of Buganda for using on British Blue ensign. The crane was added in the center to avoid the flag's association with a particular geographic region."},
{"continent":"Africa","country":"Western Sahara","capital":"El Aaiun","info":"The flag of the Sahrawi Arab Democratic Republic is a combination of the Pan-Arab colors of black, green, white, and red, and the Islamic symbol of the star and crescent. On 27 February 1976 the flag was adopted as the official flag of the Sahrawi Arab Democratic Republic (SADR). It was slightly modified in June 1991. It is said to be designed by El Uali Mustapha Sayed, the first president of the Sahrawi Republic. This flag is commonly referred to as the ","infoTwo":"The flag is a tricolor of three equal horizontal stripes (black, white, and green from top to bottom) overlaid by a red triangle issuing from the hoist. These are the Pan-Arab colors. There is a red star and crescent in the middle stripe. Its design is based on that of the Palestinian flag, which in turn was derived from the colors used in the Arab Revolt. The star and crescent are considered symbols of Islam, and can be seen on flags of other neighbouring Islamic countries such as Algeria and Mauritania."},
{"continent":"Africa","country":"Zambia","capital":"Lusaka","info":"The flag of Zambia, adopted on October 24, 1964, is green with an orange coloured eagle in flight over a rectangular block of three vertical stripes, coloured, from left to right: red, black and orange. The placement of the eagle and block of stripes at the flag's fly is notable as most emblems and devices on flags are placed at centre or at the hoist. The colours used in the flag of Zambia are rich in symbolism.","infoTwo":"Green stands for the nation's lush flora, red for the nation's struggle for freedom, black for the Zambian people, and orange for the land's natural resources and mineral wealth. Additionally, the eagle flying above the coloured stripes is intended to represent the people's ability to rise above the nation's problems."},
{"continent":"Africa","country":"Zimbabwe","capital":"Harare","info":"The national flag of Zimbabwe consists of seven even horizontal stripes of green, gold, red and black with a white triangle containing a red 5 point star with a Zimbabwe Bird. The present design was adopted on 18 April 1980, when Zimbabwe was granted independence by the United Kingdom. The soapstone bird featured on the flag represents a statuette of a bird found at the ruins of Great Zimbabwe. The bird symbolizes the history of Zimbabwe; the red star beneath it symbolizes Marxism, and the revolutionary struggle for freedom and peace. It is similar to the flag of Zimbabwe's ruling party, Zimbabwe African National Union – Patriotic Front.","infoTwo":"The national flag of Zimbabwe is made up of five different colours: Green, yellow, red, black and white. Green represents the agriculture and rural areas of Zimbabwe. Yellow stands for the wealth of minerals in the country, predominantly gold. The red symbolises the blood shed during the first and second Chimurenga (wars) in the "},
{"continent":"Asia","country":"Afghanistan","capital":"Kabul","info":"The flag of Afghanistan has had more changes since the start of the 20th century than has that of any other country in the world. Afghanistan has had 20 different flags since the first flag when the Hotaki dynasty which made Afghanistan independent was established in 1709. The current flag was adopted by the Islamic Republic of Afghanistan in 2004.","infoTwo":"This flag is similar to the one flown in Afghanistan during the monarchy between 1930 and 1973. The difference is the addition of the shahadah at the top of the coat of arms (seen in yellow) in the center. This flag consists of three stripes of the colors black, red, and green. This has been present on most flags of Afghanistan in the last twenty years. The center emblem is the classical emblem of Afghanistan with a mosque with its mihrab facing Makah."},
{"continent":"Asia","country":"Bahrain","capital":"Manama","info":"The national flag of Bahrain consists of a white band on the left, separated from a red area on the right by five triangles that serve as a serrated line. The five triangles symbolises the 5 pillars of Islam. It is sometimes mistaken for the flag of Qatar, but that flag is maroon, not red, has more points (9), and normally has a much greater length-to-width ratio.","infoTwo":"The oldest known flags of Bahrain were plain red. In 1820, Bahrain signed a treaty with the United Kingdom, and a white stripe was added to the flag to indicate the truce. In 1932, a serrated edge was added to distinguish the flag of Bahrain from those of its neighbours. The flag originally had twenty-eight white points, but this was reduced to eight in 1972. On 14 February 2002, the number was again reduced to five, so that each of the points could stand for one of the Five Pillars of Islam."},
{"continent":"Asia","country":"Bangladesh","capital":"Dhaka","info":"The national flag of Bangladesh was adopted officially on 17 January 1972. It consists of a red disc on top of a green field, offset slightly toward the hoist so that it appears centred when the flag is flying. The red disc represents the sun rising over Bengal, and also the blood of those who died for the independence of Bangladesh. The green field stands for the lushness of the land of Bangladesh.","infoTwo":"The first version of the flag was designed and made by a section of student leaders and activists of Shawdhin Bangla Nucleus on June 6, 1970, at room 108 of Iqbal Hall (now Sergeant Zahurul Haq hall), Dhaka University. The national flag is bottle green in color and rectangular in size with the length to width ratio of 10:6 bearing a red circle on the body of the green. The red circle has a radius of one fifth of the length of the flag. Its center is placed on the middle of the perpendicular drawn from the nine twentieth part of the flag. The background colour symbolizes the greenery of Bangladesh with its vitality and youthfulness while the red disc represents the rising sun and the sacrifice of its people made to obtain independence."},
{"continent":"Asia","country":"Bhutan","capital":"Thimphu","info":"The national flag of Bhutan is one of the national symbols of Bhutan. The flag is based upon the tradition of the Drukpa Lineage of Tibetan Buddhism and features Druk, the Thunder Dragon of Bhutanese mythology. The basic design of the flag by Mayum Choying Wangmo Dorji dates to 1947. A version was displayed in 1949 at the signing of the Indo-Bhutan Treaty. A second version was introduced in 1956 for the visit of Druk Gyalpo Jigme Dorji Wangchuk to eastern Bhutan; it was based upon photos of its 1949 predecessor and featured a white Druk in place of the green original.","infoTwo":"The current flag is divided diagonally from the lower hoist-side corner, with the upper triangle yellow and the lower triangle orange. Centred along the dividing line is a large black and white dragon facing away from the hoist side. The dragon is holding a norbu, or jewel, in each of its claws. The background colours of the flag, yellow and orange, are identified as Pantone 116 and 165 respectively. Equivalents of these shades and the white of the Druk are specified by various other codes according to particular matching systems as indicated below."},
{"continent":"Asia","country":"Brunei","capital":"Bandar Seri Begawan","info":"The national flag of Brunei has the crest of Brunei in the center, on a yellow field. The field is cut by black and white diagonal stripes (parallelograms at an angle). The yellow field represents the sultan of Brunei. In Southeast Asia, yellow is traditionally the color of royalty, and the royal standards of Malaysia and Thailand, and the flag of Sarawak, along with the presidential flag of Indonesia, also use a yellow field.","infoTwo":"The crest consists of a crescent (symbolizing Islam) facing upwards, joined with a parasol (symbolizing monarchy), with hands on the sides (signifying the benevolence of the government). On the crescent is the national motto in Arabic: “Always render service with God's guidance”. Below this is a banner inscribed with Brunei Darussalam (‘Brunei, the Abode of Peace’). The black and white stripes represent Brunei's chief ministers who were once joint-regents and then – after the sultan came of age – senior advisors: the Pengiran Bendahara (First Minister, symbolized by a slightly thicker white stripe) and the Pengiran Pemancha (Second Minister, governing foreign affairs, symbolized by black)."},
{"continent":"Asia","country":"Cambodia","capital":"Phnom Penh","info":"The national flag of Cambodia in its present form was originally adopted in 1948 and readopted in 1993, after elections restored the monarchy. Since around 1850, the Cambodian flag has featured a depiction of Angkor Wat in the center. The current flag, with a blue border and red central (the stripes are in the ratio 1:2:1) was adopted following Cambodia's independence in 1948.","infoTwo":"The flag used today is the same as that established in 1948, although since then 5 other designs have been used. Almost all made use of the image of the temple of Angkor Wat in one form or another. This famous temple site, which dates from the 12th century, was built by the Mahidharapura monarchs. It has 5 towers, but these were not always all depicted in the stylised version used on flags. The monarchy was restored in September 1993, the 1948 flag having been readopted in June of that year."},
{"continent":"Asia","country":"China","capital":"Beijing","info":"The flag of the People's Republic of China is a red field charged in the canton (upper corner nearest the flagpole) with five golden stars. The design features one large star, with four smaller stars in a semicircle set off towards the fly (the side farthest from the flag pole). The red represents the communist revolution; the five stars and their relationship represent the unity of the Chinese people under the leadership of the Communist Party of China (CPC). Sometimes, the flag is referred to as the ","infoTwo":"According to the current government interpretation of the flag, the red background symbolizes the revolution and the golden colors were used to "},
{"continent":"Asia","country":"East Timor","capital":"Dili","info":"The flag of East Timor was adopted in 2002. It is the same as the 1975 flag. At midnight on May 19, and during the first moments of Independence Day, 20 May 2002, the United Nations Flag was lowered and the flag of an independent East Timor was raised.","infoTwo":"As per the Constitution of the Democratic Republic of Timor-Leste, the yellow triangle represents "},
{"continent":"Asia","country":"India","capital":"New Delhi","info":"The National Flag of India is a horizontal rectangular tricolour of deep saffron, white and India green; with the Ashoka Chakra, a 24-spoke wheel, in navy blue at its centre. It was adopted in its present form during a meeting of the Constituent Assembly held on 22 July 1947, when it became the official flag of the Dominion of India. The flag was subsequently retained as that of the Republic of India. In India, the term ","infoTwo":"Gandhi first proposed a flag to the Indian National Congress in 1921. The flag was designed by Pingali Venkayya. In the centre was a traditional spinning wheel, symbolising Gandhi's goal of making Indians self-reliant by fabricating their own clothing. The design was then modified to include a white stripe in the centre for other religious communities, and provide a background for the spinning wheel. Subsequently, to avoid sectarian associations with the colour scheme, saffron, white and green were chosen for the three bands, representing courage and sacrifice, peace and truth, and faith and chivalry respectively."},
{"continent":"Asia","country":"Indonesia","capital":"Jakarta","info":"The national flag of Indonesia, which is known as Sang Saka Merah-Putih (","infoTwo":"The red stands for courage, while the white stands for purity. The red represents human's body or physical life, while white represents human's soul or spiritual life. Together they stand for a complete human being. Several opinions have been expressed on the meaning of the red and white in the Indonesian flag. One opinion is that the red stands for courage, while the white stands for purity. Another is that red represents the human body or physical life, while white represents the soul or spiritual life; together they stand for a complete human being."},
{"continent":"Asia","country":"Iran","capital":"Tehran","info":"The current flag of Iran was adopted on 29 July 1980, and is a reflection of the changes brought about by the Iranian Revolution. Its field is a tricolour comprising equal horizontal bands of green, white, and red.","infoTwo":"Written in white and repeated eleven times on the inner edges of each the green and the red band is the phrase Allahu Akbar (Allah is the greatest) in a stylized version of the kufic script and symbolizes the calls of Allahu Akbar in the night of the 22nd of Bahman, the eleventh of February 1979 the day the national radio broadcast: "},
{"continent":"Asia","country":"Iraq","capital":"Baghdad","info":"The flag of Iraq includes the three equal horizontal red, white, and black stripes of the Arab Liberation flag. This basic tricolor has been in use since 1963, with several changes to the green symbols in the central white stripe; the most recent version bears the takb_r rendered in green.","infoTwo":"There are three equal horizontal bands of red (top), white, and black; the Takb_r (Arabic expression meaning "},
{"continent":"Asia","country":"Israel","capital":"Jerusalem","info":"The flag of Israel was adopted on October 28, 1948, five months after the establishment of the State of Israel. It depicts a blue hexagram on a white background, between two horizontal blue stripes.","infoTwo":"The flag was designed for the Zionist Movement in 1891. The basic design recalls the Ashkenazi Tallit, the Jewish prayer shawl, which is white with blue stripes. The symbol in the centre represents the Star of David ("},
{"continent":"Asia","country":"Japan","capital":"Tokyo","info":"The national flag of Japan is a white rectangular flag with a large red disc (representing the sun) in the center. This flag is officially called Nissh_ki in Japanese, but is more commonly known as Hinomaru (","infoTwo":"The exact origin of the Hinomaru is unknown, but the rising sun seems to have had some symbolic meaning since the early 7th century (the Japanese archipelago is east of the Asian mainland, and is thus where the sun "},
{"continent":"Asia","country":"Jordan","capital":"Amman","info":"The flag of Jordan, officially adopted on 18 April 1928, is based on the flag of the Arab Revolt against the Ottoman Empire during World War I. The flag consists of horizontal black, white, and green bands that are connected by a red chevron. The colors stand are the Pan-Arab Colors, representing the Abbasid (black band), Umayyad (white band), and Fatimid (green band) caliphates. The red chevron is for the Hashemite dynasty, and the Arab Revolt.","infoTwo":"The seven-pointed star stands for the seven verses of the first surah in the Qur'an, and also stands for the unity of the Arab peoples. Some people believe it also refers to the seven hills on which Amman, the capital, was built. In addition to the bands and chevron, a white star with seven points is featured on the hoist side of the red chevron. The seven points symbolize the seven verses of Islamic belief, which is mentioned at the beginning of the Qur'an. The seven points represent faith in one God, humanity, humility, national spirit, virtue, social justice, and aspiration. The star also stands for the unity of the Arab nation."},
{"continent":"Asia","country":"Kazakhstan","capital":"Astana","info":"The current flag of Kazakhstan or Kazakh flag was adopted on 4 June 1992, replacing the flag of the Kazakh Soviet Socialist Republic. The national flag of the Republic of Kazakhstan has a gold sun with 32 rays above a soaring golden steppe eagle, both centered on a sky blue background; the hoist side displays a national ornamental pattern ","infoTwo":"The pattern represents the art and cultural traditions of the old khanate and the Kazakh people. The light blue background stands for the various Turkic peoples that make up the present-day population of the country, including the Kazakhs, Tatars, Uyghurs, Uzbeks and others. The light blue color symbolizes peace, freedom, cultural and ethnic unity of Kazakhstani people. The sun represents the source of life and energy. It is also a symbol of wealth and abundance; the sun's rays are like grain which is the basis of abundance and prosperity."},
{"continent":"Asia","country":"Kuwait","capital":"Kuwait City","info":"The flag of Kuwait was adopted on September 7, 1961, and officially hoisted November 24, 1961. Before 1961, the flag of Kuwait, like those of other Persian Gulf states, was red and white with the word ","infoTwo":"The colours' meaning came from a poem by Safie Al-Deen Al-Hali: White are our deeds / Black are our battles / Green are our lands / Red are our swords"},
{"continent":"Asia","country":"Kyrgyzstan","capital":"Bishkek","info":"The flag of Kyrgyzstan was adopted on 3 March 1992 by the Supreme Council of Kyrgyzstan. It consists of a red field with a yellow sun in the center having 40 uniformly spaced rays. In the center of the sun is a red ring crossed by two sets of three lines, a stylized representation of the tündük, or crown of the traditional Kyrgyz yurt, a symbol also on the national emblem and replicated in many facets of Kyrgyz architecture.","infoTwo":"The red background of the flag symbolizes bravery and valor, the sun represents peace and wealth, and the tunduk signifies the family home or, by extension, the universe. According to popular interpretations, the sun's 40 rays represent the 40 Kyrgyz tribes unified against the Mongols by the epic hero Manas."},
{"continent":"Asia","country":"Laos","capital":"Vientiane","info":"The flag of Laos was adopted on December 2, 1975. The flag had previously been used by the short-lived Lao Issara government of 1945-46, then by the Pathet Lao. The national flag of Laos was adopted in 1975, when the country became a people's republic. It is the only flag of a currently Communist country that does not use the five-pointed star as an emblem.","infoTwo":"In the center is a white disk symbolizing the unity of the people under the leadership of the Lao People's Revolutionary Party and the country's bright future. It is also said to represent a full moon against the Mekong River. The red stripes stand for the blood shed by the people in their struggle for freedom, and the blue symbolizes their prosperity."},
{"continent":"Asia","country":"Lebanon","capital":"Beirut","info":"The flag of Lebanon is formed of two horizontal red stripes enveloping a horizontal white stripe. The white stripe is to be two times a red one (ratio 1:2:1)—a Spanish fess. The green cedar (Lebanon Cedar) in the middle touches each of the red stripes and its width is one third of the width of the flag.","infoTwo":"For the Lebanese, the cedar is a symbol of hope, freedom and memory. In 1920, in a text of the proclamation of the State of Greater Lebanon, it was said: "},
{"continent":"Asia","country":"Malaysia","capital":"Kuala Lumpur","info":"The flag of Malaysia, also known as the Jalur Gemilang (Malay for ","infoTwo":"In blazon, the Malaysian flag is described as: "},
{"continent":"Asia","country":"Maldives","capital":"Malé","info":"The flag of the Republic of Maldives is red with a large green rectangle in the center bearing a vertical white crescent; the closed side of the crescent is on the hoist side of the flag. It was adopted on July 25, 1965.","infoTwo":"The red rectangle represents the boldness of the nation's heroes, and their willingness to sacrifice their every drop of blood in defense of their country. The green rectangle in the center symbolizes peace and prosperity. The white crescent moon symbolizes a state of unified Islamic faith."},
{"continent":"Asia","country":"Mongolia","capital":"Ulan Bator","info":"The Flag of Mongolia consists of three equal bands, of alternating red, blue and red, with the soyombo national symbol[1] centering the first red band in yellow.","infoTwo":"The central blue band is described as the eternal blue sky, while the side red bands represent the ability of Mongolia to thrive in its harsh environment. The soyombo is a columnar arrangement of abstract and geometric representations of fire, sun, moon, earth, water, and the Taijitu or Yin-Yang symbol. The current flag was adopted on February 12, 1992, after the transition of Mongolia to a democracy. It is similar to the flag of 1949, except for the removal of the socialist star on top of the Soyombo."},
{"continent":"Asia","country":"Myanmar","capital":"Naypyidaw","info":"Burma, officially the Republic of the Union of Myanmar, adopted a new state flag on 21 October 2010 to replace the former flag in use since 1974. The new flag was introduced along with implementing changes to the country's name, which were laid out in the 2008 Constitution. The new flag is basically a fusion of the flag of the State of Burma without the royal peacock, taking instead the white star that symbolised the Union of Burma in the canton of its flag.","infoTwo":"The design of the flag has three horizontal stripes of yellow, green and red with a five-pointed white star in the middle. The new flag is a horizontal tricolour flag of yellow, green and red charged with a five-pointed white star in the middle of the field. The yellow represents solidarity; the green symbolizes peace, tranquility and lush greenery; the red represents courage and determination; and the white star stands for the significance of the union of the country."},
{"continent":"Asia","country":"Nepal","capital":"Kathmandu","info":"The national flag of Nepal is the world's only non-quadrilateral national flag. The flag is a simplified combination of two single pennons, the vexillological word for a pennant. The flag was adopted, with the formation of a new constitutional government, on December 16, 1962. The individual pennants had been used for the preceding two centuries and the double pennant since the 19th century. The flag borrows the basic design from the original design, which has been in use for more than 2,000 years.","infoTwo":"The blue border symbolizes the peace and harmony that has been prevalent in the country since the age of Gautama Buddha, who was born in Nepal. The crimson red is Nepal's national colour, and it indicates the brave spirits of the Nepalese people. The two triangles symbolize the Himalaya Mountains and could also represent the two major religions, Hinduism and Buddhism. The depiction of celestial bodies represents permanence, the hope that Nepal will last as long as the sun and the moon. The moon symbolizes that the Nepalese are soothing and calm, while the sun symbolizes fierce resolve. The moon also symbolizes the shades and the cool weather of the Himalayas, whereas the sun symbolizes the heat and the high temperature at the lower part (Tarai) of Nepal."},
{"continent":"Asia","country":"North Korea","capital":"Pyongyang","info":"The flag of North Korea (officially the Democratic People's Republic of Korea) was adopted on 8 September 1948, as the national flag and ensign. The flag was adopted when the northern portion of Korea became a socialist republic supported by the People's Republic of China and the Soviet Union following the restoration of independence of Korea and the surrender of the Empire of Japan. The flag itself was designed in the USSR and formally replaced the previous one in July 1948.","infoTwo":"The North Korean flag's prominent red star is a universal symbol of communism, although since the flag's adoption, the application of the Marxist-Leninist-natured philosophy of Juche has replaced communist authority as the state's guiding ideology, and references to Communism have been systematically removed from the country's constitution and legal documents. The red stripe expresses revolutionary traditions. The two blue stripes stand for sovereignty, peace and friendship. The white stripes symbolize purity."},
{"continent":"Asia","country":"Oman","capital":"Muscat","info":"The national flag of Oman consists of three stripes (white, green and red) with a red bar on the left that contains the national emblem of Oman (Dagger and two swords). Until 1970, Oman used the plain red banner of the indigenous people. In 1970, the Sultan introduced a complete new set of national flags. Bands of green and white were added to the fly, and the national emblem, the badge of the Albusaidi Dynasty, was placed in the canton.","infoTwo":"This depicts crossed swords over a khanjar, a traditional curved dagger. White has been associated historically with the Imam, the religious leader of Oman and at times the political rival to the ruling Sultan. It also symbolizes peace. Green is traditionally associated with the Jebel al Akhdar, or "},
{"continent":"Asia","country":"Pakistan","capital":"Islamabad","info":"The national flag of Pakistan was adopted in its present form during a meeting of the Constituent Assembly on August 11, 1947, just three days before the country's independence, when it became the official flag of the Dominion of Pakistan. It was afterwards retained by the current-day Islamic Republic of Pakistan. The flag is a green field with a white crescent moon and five-rayed star at its center, and a vertical white stripe at the hoist side. Though the green color is mandated only as 'dark green', its official and most consistent representation is Pakistan green, which is shaded distinctively darker.","infoTwo":"The flag contains green with a vertical white band (symbolizing the role of religious minorities) on the hoist side; a large white crescent and star are centered in the green field; the crescent, star, and color green are traditional symbols of Islam. The flag was designed by Amiruddin Kidwai, and is based on the All-India Muslim League flag. Pakistan was carved out from British India as a home to Indian Muslims."},
{"continent":"Asia","country":"Palestine","capital":"Ramallah and Gaza","info":"The Palestinian flag is based on the Flag of the Arab Revolt, and is used to represent the Palestinian people. The flag is a tricolor of three equal horizontal stripes (black, white, and green from top to bottom) overlaid by a red triangle issuing from the hoist. These are the Pan-Arab colors. The flag is almost identical to that of the Baath Party, and extremely similar to the flags of Jordan, and Western Sahara, all of which draw their inspiration from the Arab Revolt against Ottoman rule (1916–1918).","infoTwo":"The origins of the flag are the subject of dispute and mythology. In one version, the colours were chosen by the Arab nationalist 'Literary Club' in Constantinople in 1909, based on the words of the 13th-century Arab poet Safi a-Din al-Hili: Ask the high rising spears, of our aspirations / Bring witness the swords, did we lose hope / We are a band, honor halts our souls / Of beginning with harm, those who won’t harm us / White are our deeds, black are our battles, / Green are our fields, red are our swords. (Safi al-Din al-Hili, poet)."},
{"continent":"Asia","country":"Philippines","capital":"Manila","info":"The National Flag of the Philippines commonly known as the Three Stars and a Sun is a horizontal flag bicolor with equal bands of royal blue and scarlet red, and with a white equilateral triangle at the hoist; in the center of the triangle is a golden yellow sun with eight primary rays. This flag can indicate a state of war if it is displayed with the red side on top.","infoTwo":"The Philippine national flag has a rectangular design that consists of a white equilateral triangle, symbolizing equality and fraternity; a horizontal blue stripe for peace, truth, and justice; and a horizontal red stripe for patriotism and valor. In the center of the white triangle is an eight-rayed golden sun symbolizing unity, freedom, people's democracy, and sovereignty. Each ray represents one of the first eight provinces that started the 1896 Philippine Revolution against Spain. Ambrosio Rianzares Bautista, who wrote the Philippine Declaration of Independence and who read it on the occasion of its proclamation on June 12, 1898, has listed the eight provinces as Manila, Cavite, Bulacan, Pampanga, Nueva Ecija, Tarlac, Laguna, and Batangas. Three five-pointed stars, one for each of the triangle's points, stand for the three major islands where the revolution started: Luzon, Panay Island and Mindanao, as mentioned in the 1898 Declaration of Independence."},
{"continent":"Asia","country":"Russia","capital":"Moscow","info":"The flag of the Russian Federation is a tricolor flag consisting of three equal horizontal fields; white on the top, blue in the middle and red on the bottom. The flag was first used as an ensign for Russian merchant ships and only became official in 1696. The flag continued to be used by the Russian Provisional Government after the Tsar was toppled in the February Revolution and was not replaced until the October Revolution which established the Russian Socialist Federative Soviet Republic - the world's first constitutionally socialist state.","infoTwo":"It was not until the dissolution of the Soviet Union in 1991 that the tricolor was brought back as the official flag of the new Russian Federation. The modern era flag underwent a proportion change in 1993 and has been official since 2000. There is no official meaning assigned to the colors of the flag. Many Russians associate white with nobility, blue with honesty, and red with courage or love."},
{"continent":"Asia","country":"Saudi Arabia","capital":"Riyadh","info":"The flag of Saudi Arabia is the flag used by the government of Saudi Arabia since March 15, 1973. It is a green flag featuring in white an Arabic inscription and a sword. The inscription is the Islamic creed, or shahada, which states, ","infoTwo":"The green of the flag represents Islam and the sword stands for the House of Saud, the founding dynasty of the country, or the military strength and prowess of Saudi Arabia. Because the shahada is considered holy, the flag is not normally used on T-shirts or other items."},
{"continent":"Asia","country":"Singapore","capital":"Singapore","info":"The national flag of Singapore was first adopted in 1959, the year Singapore became self-governing within the British Empire. It was reconfirmed as the national flag when the Republic gained independence on 9 August 1965. The design is a horizontal bicolour of red above white, overlaid in the canton (upper-left quadrant) by a white crescent moon facing a pentagon of five small white five-pointed stars. The elements of the flag denote a young nation on the ascendant, universal brotherhood and equality, and national ideals.","infoTwo":"The Singapore Arms and Flag and National Anthem Rules define the flag's composition and the symbolism of its elements: red symbolizes "},
{"continent":"Asia","country":"South Korea","capital":"Seoul","info":"The Flag of South Korea, or Taegukgi (sometimes also romanized as Taegeukgi) is the national flag for the Republic of Korea. It has three parts: a white background, a red and blue Taeguk, which is a red and blue Taiji yin- and yang-symbol in the center, and four black trigrams, which are selected from the original eight, on each corner of the flag.","infoTwo":"The white background is a traditional Korean color. It represents peace and purity. The circle in the middle is derived from the philosophy of yin and yang and represents the balance of the universe. The blue section represents the negative cosmic forces, and the red section represents the opposing positive cosmic forces. The trigrams together represent the principle of movement and harmony. Each trigram represents one of the four classical elements."},
{"continent":"Asia","country":"Sri Lanka","capital":"Sri Jayawardenapura-kotte","info":"The flag of Sri Lanka, also called the Lion Flag, consists of a gold lion, holding a kastane sword in its right fore paw, in front of a dark red background with four golden bo leaves, one in each corner. Around the background is a yellow border, and to its left are 2 vertical stripes of equal size in green and saffron, with the saffron stripe closest to the lion. It was adopted in 1950 following the recommendations of a committee appointed by the 1st Prime Minister of Ceylon, The Rt Hon D.S. Senanayake.","infoTwo":"The lion represents the Sinhalese ethnicity and the bravery of the Sri Lankan nation while the four Bo leaves represent Mett_, Karuna, Mudita and Upekkha. The orange stripe represents the Sri Lankan Tamils, the green stripe represents Sri Lankan Moors, and the maroon background represents the majority Sinhalese, like the lion. The national flag of Sri Lanka represents the country and its heritage as rallying device that integrates the minorities with the majority race."},
{"continent":"Asia","country":"Syria","capital":"Damascus","info":"As a result of the ongoing Syrian civil war, there are currently two governments claiming to be the de jure government of Syria, using different flags to represent the state. The incumbent government, led by Bashar al-Assad and the Ba'ath Party, is using the red-white-black United Arab Republic flag in use since 1980; while the Syrian Interim Government, led by the Syrian National Coalition – seeking to overthrow the Assad government – readopted the green-white-black Independence flag in 2012.","infoTwo":"Red symbolizes the struggle and sacrifice for freedom; white signifies peace; and black stands for the dark colonial past. The current flag was first adopted in 1958 to represent Syria as part of the United Arab Republic, and was used until 1961. It was readopted in 1980. Since its first adoption, variations of the red-white-black flag have been used in various Arab Unions of Syria with Egypt, Libya, Sudan, Yemen and Iraq. Although Syria is not part of any Arab state union, the flag of the United Arab Republic was readopted to show Syria's commitment to Arab unity."},
{"continent":"Asia","country":"Taiwan","capital":"Taipei","info":"The Flag of the Republic of China is red with a navy blue canton bearing a white sun with twelve triangular rays. In Chinese, the flag is commonly described as Blue Sky, White Sun, and a Wholly Red Earth to reflect its attributes. The canton originated from the ","infoTwo":"In the "},
{"continent":"Asia","country":"Tajikistan","capital":"Dushanbe","info":"Tajikistan was the last of the former Soviet republics to reveal a new flag, which was adopted in November 1992. The one common link between this and the 1953 SSR flag is the choice of colors - red, white and green. The former Tajik SSR, added white and green stripes to the flag of the USSR. The striping also emphasizes Tajikistan's Persian culture, as Iran's flag has the same stripes (although red and green are reversed).","infoTwo":"The crown represents the Tajik people, the name itself arguably is derived from tajvar, which means "},
{"continent":"Asia","country":"Thailand","capital":"Bangkok","info":"The flag of the Kingdom of Thailand shows five horizontal stripes in the colours red, white, blue, white and red, with the central blue stripe being twice as wide as each of the other four. The design was adopted on 28 September 1917, according to the royal decree issued by Rama VI that year.","infoTwo":"The colours are said to stand for nation-religion-king, an unofficial motto of Thailand, red for the land and people, white for Theravada Buddhism and blue for the monarchy, the last having been the auspicious colour of Rama VI. As the king had declared war on Germany that July, some note the flag now bore the same colours as those of Britain, France, and the United States."},
{"continent":"Asia","country":"Turkmenistan","capital":"Ashgabat","info":"The flag of Turkmenistan was adopted on January 24, 2001. The most detailed national flag in the world, it features a green field with a vertical red stripe near the hoist side, containing five carpet guls (designs used in producing rugs) stacked above two crossed olive branches similar to those on the flag of the United Nations; a white waxing crescent moon, typical of Turkic and Islamic symbology, and five white five-pointed stars appear in the upper corner of the field just to the fly side of the red stripe.","infoTwo":"The green and red colors appear in this flag because they have been venerated historically by the Turkmen. The waxing crescent moon symbolizes the hope of the country for a shining future and the stars represent the five provinces (welayatlar) of Turkmenistan – Ahal, Balkan, Dashhowuz, Lebap, and Mary."},
{"continent":"Asia","country":"United Arab Emirates","capital":"Abu Dhabi","info":"The flag of the United Arab Emirates was adopted on December 2, 1971. It contains the Pan-Arab colors red, green, white and black, which symbolize Arabian unity. Merchant ships may fly the alternative civil ensign, a red flag with the national flag in the canton.","infoTwo":"Each of the seven emirates within the United Arab Emirates has its own flag, except for Fujairah, which uses the federal flag as state flag too. The flags are derived from the traditional red flags used traditionally by the different Arab emirates around the Persian Gulf. Under the protection of the British Empire from 1820, it was decided to add a white field at the hoist of the flag. The same basic pattern can be seen in the flag of Bahrain and the flag of Qatar, emirates who opted not to join the UAE when it was created in the 1970s."},
{"continent":"Asia","country":"Uzbekistan","capital":"Tashkent","info":"The flag of Uzbekistan consists of three horizontal blue, white and green bands separated by two thin red fimbriations, with a crescent moon and twelve stars at the canton. Adopted in 1991 to replace the flag of the Uzbek Soviet Socialist Republic (SSR), it has been the flag of the Republic of Uzbekistan since the country gained independence in that same year. The design of the present flag was partly inspired by the former one.","infoTwo":"The colors and symbols of the flag carry cultural, political, and regional meanings. The white stands for peace and purity, while blue represents water and the sky. The latter colour also alludes to the flag of Timur, who ruled over present-day Uzbekistan during the 14th century. Green officially epitomizes "},
{"continent":"Asia","country":"Vietnam","capital":"Hanoi","info":"The flag of Vietnam, or ","infoTwo":"S_n Tùng stated that the flag was designed by Nguy_n H_u Ti_n, a leader of the uprising who was arrested by the French in advance of the failed uprising and executed Aug. 28, 1941. Ti_n, who was born in the northern village of L_ng Xuyên, was unknown to the Vietnamese public before Tùng's research was published. According to a poem Ti_n wrote, the red background represents blood while the yellow foreground represents "},
{"continent":"Asia","country":"Yemen","capital":"Sana'a","info":"The Flag of Yemen was adopted on May 22, 1990, the day that North Yemen and South Yemen were unified. The flag is essentially the Arab Liberation Flag of 1952, introduced after the Egyptian Revolution of 1952 in which Arab nationalism was a dominant theme. The Arab Liberation Flag served as the inspiration for the flags of both North and South Yemen prior to unification, and the current flags of Egypt, Iraq, Sudan, and Syria.","infoTwo":"According to the official description, the red stands for the bloodshed of martyrs and unity; the white for a bright future; black for the dark past."},
{"continent":"Europe","country":"Albania","capital":"Tirana","info":"The Flag of Albania is a red flag with a silhouetted black double-headed eagle in the center. The red stands for bravery, strength and valor, while the double-headed eagle represents the sovereign state of Albania located in the Balkans.","infoTwo":"The symbol of the double-headed eagle was re-used by Albanian nationalists during the late 19th and early 20th centuries as a symbol of their campaign for their country's independence from the Ottoman Empire. On 28 November 1912, the Albanian Declaration of Independence was proclaimed in Vlora and the flag, raised by Ismail Qemal, was adopted as the symbol of the new nation."},
{"continent":"Europe","country":"Andorra","capital":"Andorra La Vella","info":"The national flag of the Principality of Andorra was adopted in 1866. The flag is a vertical tricolour of blue, yellow, and red with the coat of arms of Andorra in the centre. Although the three vertical bars may at first appear to be of equal width, the centre yellow bar is slightly wider than the other two so that the ratio of bar widths is 8:9:8. The overall flag ratio is 7:10.","infoTwo":"The design is related to the flags of France and Spain, the two states that protect the independence of the small country. A flag of three bars is similar to that of the French Tricolor, while the pattern of a wider middle stripe can be noted on the Spanish flag. The blue and red of the Andorran flag are also found on the French flag, with red and yellow also being the principal colors of the Spanish flag. From 1806 to 1866, Andorra's flag was a vertical bi-color of yellow and red. The motto in the coat of arms in the middle stripe Virtus Unita Fortior means "},
{"continent":"Europe","country":"Armenia","capital":"Yerevan","info":"The national flag of Armenia, the Armenian Tricolour or Yeraguyn, consists of three horizontal bands of equal width, red on the top, blue in the middle, and orange (also described as ","infoTwo":"The red emblematizes the Armenian Highland, the Armenian people's continued struggle for survival, maintenance of the Christian faith, Armenia's independence and freedom. The blue emblematizes the will of the people of Armenia to live beneath peaceful skies. The orange emblematizes the creative talent and hard-working nature of the people of Armenia."},
{"continent":"Europe","country":"Austria","capital":"Vienna","info":"The flag of Austria has three equal horizontal bands of red, white, and red. The Austrian triband is based on the coat of arms of the Babenberg dynasty, recorded in the 13th century. It may have seen use in flags from about the 15th century, alongside the black-and-yellow colours of the House of Habsburg and other insignia of the Holy Roman Empire. It was adopted as a naval ensign in the 18th century, and as national flag in 1918.","infoTwo":"Duke Friedrich II (1210-1246), the last Babenberg, sought to become more independent of the Roman Emperor (also Friedrich II) and adopted as a new "},
{"continent":"Europe","country":"Azerbaijan","capital":"Baku","info":"The flag of Azerbaijan is a tricolour featuring three equally sized fesses of blue, red, and green, with a white crescent and an eight-pointed star centered in the red. The blue symbolises Azerbaijan's Turkic heritage, the red stands for progress, and the green represents Islam. The official colors and size were adopted on February 5, 1991. This flag was used from November 9, 1918 to 1920, when Azerbaijan was independent, and it was revived on February 5, 1991.","infoTwo":"The nickname for the flag is "},
{"continent":"Europe","country":"Belarus","capital":"Minsk","info":"The current national flag of Belarus is a red and green flag with a white and red ornament pattern placed at the staff (hoist) end. The current design was introduced in 2012 by the State Committee for Standardization of the Republic of Belarus, and is adapted from a design approved in a referendum in May 1995. It is a modification of the 1951 flag used while the country was a republic of the Soviet Union. Changes made to the Soviet-era flag were the removal of symbols of communism (the hammer and sickle and the red star) and the reversal of the colors of the ornament pattern, from white on red to red on white.","infoTwo":"Red color in a flag is from ancient days. That was the color of victorious standards of the Belarusian regiments that had gained victory over crusaders at Grunewald, that was the color of flags of the Red Army divisions and Belarusian guerrilla detachments that liberated the country from fascist invaders and their henchmen. Green is the color of hope, spring and revival, the color of forests and fields. Belarusian decorative pattern is a symbol of ancient culture of folk, its spiritual richness , the unity of folk singers and makers with people. The present National Emblem of the Republic of Belarus symbolizes historical adherence of the Belarusian people to constructive labor, their faith into triumph of justice and attainment of worthy place in the world community."},
{"continent":"Europe","country":"Belgium","capital":"Brussels","info":"The national flag of Belgium is a tricolor of three bands of black, yellow, and red. The colours were taken from the coat of arms of the Duchy of Brabant, and the vertical design may be based on the flag of France. When flown, the black band is nearest the pole (at the hoist side).","infoTwo":"The colours of the Belgian flag were taken from the arms of Brabant, a province in the former Low Countries (today Belgium and the Netherlands), which extended from the Walloon province of Walloon Brabant, over the Flemish provinces of Flemish Brabant (and Brussels) and Antwerpen, and up to the Dutch province of North-Brabant. The arms of Brabant show on a black field a yellow lion facing the viewer's left, with a red tongue and nails. The heraldic description (blazon) of these arms is "},
{"continent":"Europe","country":"Bosnia and Herzegovina","capital":"Sarajevo","info":"The flag of Bosnia and Herzegovina contains a wide medium blue vertical band on the fly side with a yellow right triangle abutting the band and the top of the flag. The remainder of the flag is medium blue with seven full five-pointed white stars and two half stars top and bottom along the hypotenuse of the triangle.","infoTwo":"The three points of the triangle are understood to stand for the three constituent peoples of Bosnia and Herzegovina: Bosniaks, Croats, and Serbs. It is also seen to represent the map of Bosnia and Herzegovina which looks like a triangle. The stars, representing Europe, are meant to be infinite in number and thus they continue from top to bottom. The flag features colors often associated with neutrality and peace – white, blue, and yellow. The colors yellow and blue are also seen to be taken from the flag of Europe; the color blue was originally based on the flag of the United Nations."},
{"continent":"Europe","country":"Bulgaria","capital":"Sofia","info":"The flag of Bulgaria is a tricolour consisting of three equal-sized horizontal bands of (from top to bottom) white, green, and red. The flag was first adopted after the Russo-Turkish War (1877–1878), where Bulgaria gained independence. The national flag at times was charged with the state emblem, especially during the People's Republic of Bulgaria. The current flag was re-established with the 1991 Constitution of Bulgaria and was confirmed in a 1998 law.","infoTwo":"The flags in green, white and red colours were used by Bulgarian Legia (revolutionary organisation founded in Serbia by Bulgarian emigrants led by G. Rakovsky) in 1861-1862. The first white-green-red striped flag was made by S. Paraskevov and presented to Russian-Bulgarian troops (during the war against Turkey) in the Romanian town of Braila in 1877. It was a swallow-tailed banner. There was a lion and inscription "},
{"continent":"Europe","country":"Croatia","capital":"Zagreb","info":"The flag of Croatia is one of the state symbols of Croatia. It consists of three equal size, horizontal stripes in colours red, white and blue. In the middle is the coat of arms of Croatia. The flag combines the colors of the flags of the Kingdom of Croatia (red and white), the Kingdom of Slavonia (white and blue) and the Kingdom of Dalmatia (red and blue). Those three kingdoms are the historic constituent states of the Croatian Kingdom.","infoTwo":"The shield is in the red and white checks of Croatia. Above is a crown made of shields of its various regions. From left to right they are the ancient arms of Croatia, Dubrovnik, Dalmatia, Istria, and Slavonia. The red-white-blue tricolor has been used as the Croatian flag since 1848, and the pan-Slavic colors are widely associated with romantic nationalism. While the Banovina of Croatia existed within the Kingdom of Yugoslavia, it had a similar flag without the modern crown above the chequy. During the Independent State of Croatia, flag was like the modern, but without crown and there was letter "},
{"continent":"Europe","country":"Cyprus","capital":"Nicosia","info":"The flag of Cyprus came into use on August 16, 1960, under the Zürich and London Agreements, whereby a constitution was drafted and Cyprus was proclaimed an independent state. The flag was designed by Turkish Cypriot art teacher _smet Güney. The flag deliberately chose peaceful and neutral symbols in an attempt to indicate harmony between the rival Greek and Turkish communities, an ideal that has not yet been realized.","infoTwo":"The state flag features a map of the entirety of the island, with two olive branches below (a symbol of peace) on white (another symbol of peace). The olive branches signify peace between the Turks and Greeks. The map on the flag is a copper-orange colour, symbolizing the large deposits of copper ore on the island (chiefly in the form of chalcopyrite, which is yellow in colour), from which it may have received its name."},
{"continent":"Europe","country":"Czech Republic","capital":"Prague","info":"The national flag of the Czech Republic is the same as the flag of the former Czechoslovakia. Upon the dissolution of Czechoslovakia the Czech Republic kept the Czechoslovak flag while the Slovak Republic adopted its own flag. The first flag of Czechoslovakia was based on the arms, and was white over red. This was identical to the Flag of Poland, so a blue triangle was added at the hoist. The flag was banned by the Nazis in 1939, and a horizontal tricolor of white, red, and blue was enforced. The original flag was restored in 1945.","infoTwo":"The choice of blue meant that the colors of the flag were now red-white-blue, which in the nineteenth century were considered "},
{"continent":"Europe","country":"Denmark","capital":"Copenhagen","info":"The Flag of Denmark is red with a white Scandinavian cross that extends to the edges of the flag; the vertical part of the cross is shifted to the hoist side. The cross design, which represents Christianity, was subsequently adopted by the other Nordic countries; Sweden, Norway, Finland, Iceland, Åland Islands and the Faroe Islands, as well as the British archipelagos of Shetland and Orkney. During the Danish-Norwegian personal union, Dannebrog (","infoTwo":"The design of the Dannebrog is recorded on a seal from 1397 According to legend, the flag came into Danish possession during the Battle of Lyndanisse in 1219. The Danes were on a failing crusade in Estonia, but after praying to God a flag fell from the sky. After this event, Danish King Valdemar II went on to defeat the Estonians. The first recorded use of the flag appear one hundred years later."},
{"continent":"Europe","country":"Estonia","capital":"Tallinn","info":"The national flag of Estonia is a tricolour featuring three equal horizontal bands of blue (top), black, and white. The normal size is 105 _ 165 cm. In Estonian it is colloquially called the ","infoTwo":"There are a number of interpretations attributed to the colours of the flag. A historical interpretation of the colours has blue representing ancient freedom, black symbolizing lost independence and white, the promise of a brighter future. Another interpretation made popular by the poetry of Martin Lipp is as follows: blue represents vaulted blue sky above the native land, black is an attachment to the soil of the homeland as well as the fate of Estonians – for centuries black with worries, and white is for purity, hard work, and commitment."},
{"continent":"Europe","country":"Finland","capital":"Helsinki","info":"The flag of Finland, also called siniristilippu (","infoTwo":"Like Sweden's, Finland's national flag is based on the Scandinavian cross. It was adopted after independence from Russia, when many patriotic Finns wanted a special flag for their country, but its design dates back to the 19th century. The blue coloring is said to represent the country's thousands of lakes and the sky, with white for the snow that covers the land in winter. This color combination has also been used over the centuries in various Finnish provincial, military, and town flags."},
{"continent":"Europe","country":"France","capital":"Paris","info":"The national flag of France is a tricolour flag featuring three vertical bands coloured blue (hoist side), white, and red. It is known to English speakers as the French Tricolour or simply the Tricolour. The royal government used many flags, the best known being a blue shield and yellow fleur-de-lis on a white background, or state flag. Early in the French Revolution, the Paris militia, which played a prominent role in the storming of the Bastille, wore a cockade of blue and red, the city's traditional colours.","infoTwo":"Blue and red are the traditional colours of Paris, used on the city's coat of arms. Blue is identified with Saint Martin, red with Saint Denis. At the storming of the Bastille in 1789, the Paris militia wore blue and red cockades on their hats. White had long featured prominently on French flags and is described as the "},
{"continent":"Europe","country":"Georgia","capital":"Tbilisi","info":"The flag of Georgia, also known as the Five Cross Flag was adopted in January 2004, and was originally the flag of the United National Movement. It was widely used during the ","infoTwo":"The previous flag used by the Democratic Republic of Georgia from 1918 to 1921 was revived on 14 November 1990, by the Supreme Council of the Republic of Georgia. However, it lost popularity thereafter as it became associated with the chaotic and violent period around the collapse of the Soviet Union. The wine-red colour symbolises the good times in the past and the future, while the black represents Russian rule, and the white represents hope for peace."},
{"continent":"Europe","country":"Germany","capital":"Berlin","info":"The flag of Germany is a tricolour consisting of three equal horizontal bands displaying the national colours of Germany:black, red, and gold. The flag was first adopted as the national flag of modern Germany in 1919, during the Weimar Republic.","infoTwo":"The colours of the modern flag are associated with the republican democracy formed after World War I, and represent German unity and freedom.. During the Weimar Republic, the black-red-gold colours were the colours of the democratic, centrist, and republican political parties, as seen in the name of Reichsbanner Schwarz-Rot-Gold, formed by members of the Social Democratic, the Centre, and the Democratic parties to defend the republic against extremists on the right and left."},
{"continent":"Europe","country":"Greece","capital":"Athens","info":"The flag of Greece (popularly referred to as the ","infoTwo":"the cross symbolizes Eastern Orthodox Christianity, the established religion of the Greek people of Greece and Cyprus. According to popular tradition, the nine stripes represent the nine syllables of the phrase ("},
{"continent":"Europe","country":"Hungary","capital":"Budapest","info":"The flag of Hungary is a horizontal tricolour of red, white and green. In this exact form, it has been the official flag of Hungary since October 1, 1957. The flag's form originates from national republican movements of the 18th–19th century, while its colours are from the Middle Ages.","infoTwo":"The current flag was first used in the 1848-49 uprising. Its pattern was derived from the French Tricolore used during the French Revolution. The colors: red, white and green, date back to the 9th century. They were first used in 1608 during the reign of King Matthias II. Until 1945, the royal crown appeared in the center of the national flag."},
{"continent":"Europe","country":"Iceland","capital":"Reykjavík","info":"The flag of Iceland was officially described in Law No. 34, set out on 17 June 1944, the day Iceland became a republic. It was adopted and became the national flag when Iceland gained independence from Denmark in 1918. For the Icelandic people the flag's colouring represents a vision of their country's landscape.","infoTwo":"The colours stand for 3 of the elements that make up the island. Red is the fire produced by the island's volcanoes, white recalls the ice and snow that covers Iceland, and blue is for mountains in the distance."},
{"continent":"Europe","country":"Ireland","capital":"Dublin","info":"The national flag of Ireland – frequently referred to as the Irish tricolour – is a verticaltricolour of green (at the hoist), white, and orange. Presented as a gift in 1848 to Thomas Francis Meagher from a small group of French women sympathetic to the Irish cause, it was not until the Easter Rising of 1916, when it was raised above the General Post Office in Dublin, that the tricolour came to be regarded as the national flag.","infoTwo":"The Irish government has described the symbolism behind each colour as being that of green representing the Gaelic tradition of Ireland, orange representing the followers of William of Orange in Ireland, and white representing the aspiration for peace between them."},
{"continent":"Europe","country":"Italy","capital":"Rome","info":"The flag of Italy (often referred to in Italian as il Tricolore) is a tricolour featuring three equally sized vertical pales of green, white, and red, with the green at the hoist side. Its current form has been in use since 19 June 1946 and was formally adopted on 1 January 1948. The first entity to use the Italian tricolour was the Cispadane Republic in 1797, which supplanted Milan after Napoleon's victorious army crossed Italy in 1796.","infoTwo":"The colours chosen by the Cispadane Republic were red and white, which were the colours of the recently conquered flag of Milan; and green, which was the colour of the uniform of the Milanese civic guard. Some have attributed particular values to the colours, and a common interpretation is that the green represents the country's plains and the hills; white, the snow-capped Alps; and red, blood spilt in the Wars of Italian Independence. A more religious interpretation is that the green represents hope, the white represents faith, and the red represents charity; this references the three theological virtues."},
{"continent":"Europe","country":"Kosovo","capital":"Pristina","info":"The flag of the Republic of Kosovo was adopted by the Assembly of Kosovo immediately following the declaration of independence of the Republic of Kosovo from Serbia on 17 February 2008. The flag is the result of an international design competition, organised by the United Nations-backed Kosovo Unity Team, which attracted almost one thousand entries. The now-used design is a variant of one proposal designed by Muhamer Ibrahimi.","infoTwo":"The flag of Kosovo has a blue background, charged with a map of Kosovo and six stars. The stars are officially meant to symbolise Kosovo's six major ethnic groups: Albanians, Serbs, Turks, Gorani, Romani (often grouped with the Ashkali and Egyptians) and Bosniaks. Unofficially, the stars are sometimes said to represent the six regions, which according to Albanian ultra nationalist ideology, make up Greater Albania: Albania, Kosovo, western parts of the Republic of Macedonia, parts of northern Greece, parts of Montenegro and Presevo Valley in southern Serbia."},
{"continent":"Europe","country":"Latvia","capital":"Riga","info":"The national flag of Latvia was used by independent Latvia from 1918 until the country was occupied by the Soviet Union in 1940. Its use was suppressed during Soviet rule. After regaining its independence, Latvia re-adopted on 27 February 1990 the same red-white-red flag.","infoTwo":"Though officially adopted in 1922, the Latvian flag was in use as early as the 13th century. The red colour is sometimes described as symbolizing the readiness of the Latvians to give the blood from their hearts for freedom and their willingness to defend their liberty. An alternative interpretation, according to one legend, is that a Latvian leader was wounded in battle, and the edge of the white sheet in which he was wrapped were stained by his blood. The white stripe may stand for the sheet that wrapped him. This story is similar to the legend of the origins of the flag of Austria."},
{"continent":"Europe","country":"Liechtenstein","capital":"Vaduz","info":"The flag of Liechtenstein consists of two horizontal blue and red bands charged with a gold crown at the canton. Adopted in 1921 after being officially enshrined into the nation's constitution, it has been the flag of the Principality of Liechtenstein since that year. The crown was added to the flag in 1937 after the country found out at the Summer Olympics held the previous year that their flag was identical to the flag of Haiti.","infoTwo":"The colors and symbols of the flag carry cultural, political, and regional meanings. The blue represents the sky, while red alludes to the "},
{"continent":"Europe","country":"Lithuania","capital":"Vilnius","info":"The flag of Lithuania consists of a horizontal tricolor of yellow, green and red. It was re-adopted on March 20, 1989, almost two years before the re-establishment of Lithuania's independence and more than three years before the collapse of the Soviet Union.","infoTwo":"It was first used in Lithuania's first period of independence (in the 20th century) from 1918–1940, which ceased with the occupation first by Soviet Russia and Lithuania's illegal annexation into the Soviet Union, and then by Nazi Germany (1941–44). The yellow in the flag is meant to symbolize the golden fields of Lithuania, the green is for its green countrysides, and the red represents all the blood that has been shed for Lithuania."},
{"continent":"Europe","country":"Luxembourg","capital":"Luxembourg","info":"The flag of Luxembourg consists of three horizontal stripes, red, white and blue, and can be in 1:2 or 3:5 ratio. It was first used between 1845 and 1848 and officially adopted on June 23, 1972. Luxembourg had no flag until 1830, when patriots were urged to display the national colors. The flag was defined as a horizontal tricolor of red, white, and blue in 1848, but it was not officially adopted until 1972.","infoTwo":"The tricolor flag is almost identical to that of the Netherlands, except that it is longer and its blue stripe is a lighter shade. The red, white, and blue coloring was derived from the Grand Duke's coat of arms, which dates from the 13th century."},
{"continent":"Europe","country":"Macedonia","capital":"Skopje","info":"The national flag of the Republic of Macedonia depicts a stylised yellow sun on a red field, with eight broadening rays extending from the centre to the edge of the field. It was created by Pr. Miroslav Gr_ev and was adopted on 5 October 1995 after a one-year economic blockade imposed by Greece in order to force the Republic of Macedonia to remove the ancient Macedonian Vergina Sun from the flag.","infoTwo":"Red and yellow have always been considered the main colours representing Macedonia, probably because of the colours of the historical coat of arms of Macedonia. The new eight-rayed sun represents "},
{"continent":"Europe","country":"Malta","capital":"Valletta","info":"The flag of Malta is a basic bi-colour, with white in the hoist and red in the fly. A representation of the George Cross, awarded to Malta by George VI in 1942, is carried, edged with red, in the canton of the white stripe.","infoTwo":"The flag of the Knights of Malta, a white cross on a red field, was a more likely source of the Maltese colours, inspiring the red and white shield used during the British colonial period."},
{"continent":"Europe","country":"Moldova","capital":"Chisinau","info":"The state flag of Moldova is a vertical tricolor of blue, yellow, and red, charged with the coat of arms of Moldova (an eagle holding a shield charged with an aurochs) on the center bar. The obverse is mirrored. The flag ratio is 1:2. Until further provisions, the State Flag of Moldova is used as the national flag and ensign as well, that is, civil, state and war flag and ensign","infoTwo":"The blue, red, and yellow tricolor of Moldova is almost identical to the flag of Romania, reflecting the two countries' national and cultural affinity. On Moldova's flag the yellow stripe is charged with the national arms. Like the Romanian coat of arms, the Moldovan arms, adopted in 1990, features a dark golden eagle holding an Orthodox Christian cross in its beak. Instead of a sword, the eagle is holding an olive branch, symbolizing peace. The blue and red shield on the eagle's chest is charged with the traditional symbols of Moldova: an aurochs' head, flanked by a rose at dexter and a crescent at senester, and having a star between its horns, all of gold. These two national flags are also very similar to the flags of Chad and Andorra, which are all based on vertical stripes of blue, yellow, and red."},
{"continent":"Europe","country":"Monaco","capital":"Monaco","info":"The national flag of Monaco has two equal horizontal bands of red (top) and white, both of which have been the heraldic colors of the House of Grimaldi since at least 1339. The present bicolor design was adopted on April 4, 1881, under Prince Charles III.","infoTwo":"Monaco's original flag, which was similar to its current state flag but bore an older version of its coat of arms, was in use from the principality's early days (except during its annexation to France from 1793 to 1814) until the present, simpler design was adopted in 1881."},
{"continent":"Europe","country":"Montenegro","capital":"Podgorica","info":"The flag of Montenegro was officially adopted with the Law on the state symbols and the statehood day of Montenegro on 13 July 2004 at the proposal of the government of Montenegro. It was constitutionally sanctioned with the proclamation of the Constitution on 22 October 2007. It is a red banner with broader golden edges all around the red field with the coat of arms of Montenegro in its center.","infoTwo":"The legally established flag of Montenegro is red with a golden broder and the state coat of arms in the middle in ratio of the length to width 2:1. This flag is a traditional Montenegrin flag that acted as the state flag until the end of the internationally recognized State of Montenegro. This flag was the state flag of the Principality and letter also of the Kingdom of Montenegro. The coat of arms of Montenegro is a golden double-headed eagle with a lion in its chests."},
{"continent":"Europe","country":"Netherlands","capital":"Amsterdam","info":"The flag of the Netherlands is a horizontal tricolour of red, white, and blue. Variants of the flag have been in use since 1572, and in 1937 the flag was officially formalized as the national flag of the Kingdom of the Netherlands. It is the oldest tricolor flag still in national use.","infoTwo":"The Dutch tricolour was first used in the second half of the 16th century when the Dutch provinces revolted against Spain. Their leader was Prince William of Orange. The flag was named "},
{"continent":"Europe","country":"Norway","capital":"Oslo","info":"The flag of Norway is red with an indigo blue Scandinavian cross fimbriated in white that extends to the edges of the flag; the vertical part of the cross is shifted to the hoist side in the style of the Dannebrog, the flag of Denmark.","infoTwo":"The flag of 1821 was the idea of Frederik Meltzer, Member of Parliament from Bergen. He got the idea of adding a blue cross to the Danish flag during a meeting in the parliament. The discussion on the flag circled around considerations about reflecting the past, that is the Danish colours, which enjoyed great popularity, and considerations that the union with Sweden should also be reflected in the flag. So we can say that the red and white came from the Danish flag, the blue from the Swedish. At the same time, the colour combination red, white, blue was also attractive to the Parliament because it reflected the colours of liberty, as in the flags of France, the USA, the United Kingdom and the Netherlands."},
{"continent":"Europe","country":"Poland","capital":"Warsaw","info":"The flag of Poland consists of two horizontal stripes of equal width, the upper one white and the lower one red. The two colors are defined in the Polish constitution as the national colors. A variant of the flag with the national coat of arms in the middle of the white stripe is legally reserved for official use abroad and at sea. A similar flag with the addition of a swallow-tail is used as the naval ensign of Poland.","infoTwo":"White and red were officially adopted as national colors in 1831. They are of heraldic origin and derive from the tinctures (colors) of the coats of arms of the two constituent nations of the Polish–Lithuanian Commonwealth, i.e. the White Eagle of Poland and the Pursuer of the Grand Duchy of Lithuania, a white knight riding a white horse, both on a red shield. Prior to that, Polish soldiers wore cockades of various color combinations. The national flag was officially adopted in 1919."},
{"continent":"Europe","country":"Portugal","capital":"Lisbon","info":"The flag of Portugal is the national flag of the Portuguese Republic. It is a rectangular bicolour with a field unevenly divided into green on the hoist, and red on the fly. The lesser version of the national coat of arms (i.e. armillary sphere and Portuguese shield) is centred over the colour boundary at equal distance from the upper and lower edges. On June 30, 1911, less than a year after the downfall of the constitutional monarchy, this design was officially adopted for the new national flag, after selection by a special commission whose members included Columbano Bordalo Pinheiro, João Chagas and Abel Botelho.","infoTwo":"Since a failed republican insurrection on January 31, 1891, red and green had been established as the colours of the Portuguese Republican Party and its associated movements, whose political prominence kept growing until it reached a culmination period following the Republican revolution of October 5, 1910. In the ensuing decades, these colours were popularly propagandized as representing the hope of the nation (green) and the blood (red) of those who died defending it, as a means to endow them with a more patriotic and dignified, therefore less political, sentiment."},
{"continent":"Europe","country":"Romania","capital":"Bucharest","info":"The national flag of Romania is a tricolor with vertical stripes, beginning from the flagpole: blue, yellow and red. The Constitution of Romania provides that ","infoTwo":"Adopted 27 Dec 1989, the first tricolours were allowed in 1834 by the Ottoman sultan, that in 1848 the tricolour (but not in current in "},
{"continent":"Europe","country":"San Marino","capital":"San Marino","info":"The state and war flag of San Marino is formed by two equal horizontal bands of white (top) and light blue with the national coat of arms superimposed in the center; the coat of arms has a shield (featuring three towers on three peaks) with a closed crown on top, flanked by an oak and laurel wreath, with a scroll below bearing the word LIBERTAS (Liberty).","infoTwo":"The current flag was adopted on 6 April 1862 by a Decree of the Supreme Council and since then, little but graphic details of the coat of arms and some proportions were changed. The two colors of the flag represent peace (white) and liberty (azure)."},
{"continent":"Europe","country":"Serbia","capital":"Belgrade","info":"The flag of Serbia is a tricolour consisting of three equal horizontal bands, red on the top, blue in the middle and white on the bottom. The same tricolour, in altering variations, has been used since the 19th century as the flag of the state of Serbia and the Serbian nation. The current form of the flag was officially adopted on November 11, 2010.","infoTwo":"The Serbian tricolour has been used as the basis for other flags, most notably Montenegro which used the Serbian tricolour with varying shades of blue. During the second Yugoslavia, the republics of Serbia and Montenegro had flags of same design and colours. Montenegro changed its flag in 1993 by altering the proportion and shade of blue in its flag and used this flag until 2004. The Serbian tricolour defaced with a Serbian cross is used as the flag of the Serbian Orthodox Church. A number of other unofficial variant flags, some with variations of the cross, coat of arms, or both, exist."},
{"continent":"Europe","country":"Slovakia","capital":"Bratislava","info":"The current form of the flag of Slovakia was adopted by Slovakia's Constitution, which came into force on 3 September 1992. The flag, in common with other Slavic nations, uses the white, blue and red colours.","infoTwo":"The present-day state flag of the Slovak Republic was enacted on 1st September 1992. The height of the shield with Slovak state coat of arms is equal to half of width of the flag. The shield is separated from the blue and red stripes by the white stripe. Its width is equal to the one hundredth of the flag's length."},
{"continent":"Europe","country":"Slovenia","capital":"Ljubljana","info":"The national flag of Slovenia features three equal horizontal bands of white (top), blue, and red, with the Slovenian coat of arms located in the upper hoist side of the flag centred in the white and blue bands. The coat of arms is a shield with the image of Mount Triglav, Slovenia's highest peak, in white against a blue background at the centre; beneath it are two wavy blue lines representing the Adriatic Sea and local rivers, and above it are three six-pointed golden stars arranged in an inverted triangle which are taken from the coat of arms of the Counts of Celje, the great Slovenian dynastic house of the late 14th and early 15th centuries.","infoTwo":"The flag's colours are considered to be Pan-Slavic, but they actually come from the medieval coat of arms of theDuchy of Carniola, consisting of a blue eagle on a white background with a red-and-gold crescent. The existin gSlovene tricolor was raised for the first time in history during the Revolution of 1848 by the Slovene Romantic nationalist activist and poet Lovro Toman on 7 April 1848, in Ljubljana, in response to a German flag which was raised on top of Ljubljana Castle."},
{"continent":"Europe","country":"Spain","capital":"Madrid","info":"The flag of Spain, as it is defined in the Spanish Constitution of 1978, consists of three horizontal stripes: red, yellow and red, the yellow stripe being twice the size of each red stripe. Traditionally, the middle stripe was defined by the more archaic term of gualda, and hence the popular name rojigualda (red-weld).","infoTwo":"The origin of the current flag of Spain is the naval ensign of 1785, Pabellón de la Marina de Guerra under Charles III of Spain. It was chosen by Charles III himself among 12 different flags designed by Antonio Valdés y Bazán (all projected flags were presented in a drawing which is in the Naval Museum of Madrid). The flag remained marine for much of the next 50 years, flying over coastal fortresses, marine barracks and other naval property. During the Peninsular War the flag could also be found on marine regiments fighting inland. Not until 1820 was the first Spanish land unit (The La Princesa Regiment) provided with one and it was not until 1843 that Queen Isabella II of Spain would make the flag official."},
{"continent":"Europe","country":"Sweden","capital":"Stockholm","info":"The flag of Sweden is a Scandinavian cross that extends to the edges of the flag. This Scandinavian cross represents Christianity. The design and colours of the Swedish flag are believed to have been inspired by the present Coat of arms of Sweden of 1442, which is blue divided quarterly by a cross pattée of gold, and modelled on the Danish flag. Blue and yellow have been used as Swedish colors at least since King Magnus III's royal coat of arms of 1275.","infoTwo":"The exact age of the Swedish Flag is not known, but the oldest recorded pictures of a blue cloth with a yellow cross date from the 16th century. As decreed in a royal warrant of 1569, the yellow cross was always to be borne on Swedish battle standards and banners, as the Swedish Coat of Arms was blue divided quarterly by a cross of gold. The design of the Swedish flag is probably taken from the Danish flag, and its blue and yellow colours possibly come from the Coat of Arms."},
{"continent":"Europe","country":"Switzerland","capital":"Bern","info":"The flag of Switzerland consists of a red flag with a white cross (a bold, equilateral cross) in the centre. It is one of only two square sovereign-state flags, the other being the flag of Vatican City. After the invasion of 1798, the authorities of the Helvetic Republic confiscated all earlier flags, replacing them with the new green-red-yellow tricolour. The flag's usage did not last for long. The Tagsatzung re-introduced the white cross in the red field for the coat of arms, seal and flag of the Confederacy in 1814.","infoTwo":"Use of the white cross as a military ensign (attached to the cantonal flags in the form of strips of linen) has been used in the Old Swiss Confederacy since the 14th century, but the modern design of a white cross suspended in a square red field was introduced only during the Napoleonic period, first used in 1800 during the Hundred Days by general Niklaus Franz von Bachmann, and was introduced as official national flag in 1889."},
{"continent":"Europe","country":"Turkey","capital":"Ankara","info":"The flag of Turkey is a red flag featuring a crescent with a star. The flag is often called Al bayrak (the red flag) and referred to as Al sancak (the red banner) in the Turkish national anthem. The current design of the Turkish flag is directly derived from the late Ottoman flag, which had acquired its final form in 1844.","infoTwo":"The red represents the time of war they went through and how they survived. The star and crescent design appears on Ottoman flags beginning in the late 18th or early 19th century. The introduction of the white star and crescent on red as the flag of the Ottoman Empire dates to the Tanzimat reforms of 1844."},
{"continent":"Europe","country":"Ukraine","capital":"Kiev","info":"The state flag of Ukraine is a banner of two equally sized horizontal bands of blue and yellow colour. As a national flag, the blue and yellow bicolour was officially used since the 1848 Spring of Nations when it was hoisted over the Lviv Rathaus.","infoTwo":"The roots of Ukrainian national symbols come from before Christian times when yellow and blue prevailed in traditional ceremonies, reflecting fire and water. The most solid proof of yellow and blue colours could be traced as far as the Battle of Grunwald at which participated militia formations from various lands of the Polish-Lithuanian Union."},
{"continent":"Europe","country":"United Kingdom","capital":"London","info":"The Flag of the United Kingdom, commonly known as the Union Jack or Union Flag, is the national flag of the United Kingdom. The current design of the Union Jack dates from the union of Ireland and Great Britain in 1801. It consists of the red cross of Saint George (patron saint of England), edged in white, superimposed on the Cross of St Patrick (patron saint of Ireland), which are superimposed on the Saltire of Saint Andrew (patron saint of Scotland).","infoTwo":"The earlier flag of Great Britain was established in 1606 by a proclamation of King James VI and I of Scotland and England. The new flag of the United Kingdom was officially created by an Order in Council of 1801, reading as follows: "},
{"continent":"Europe","country":"Vatican City","capital":"Vatican City","info":"The flag of Vatican City was adopted on June 7, 1929, the year Pope Pius XI signed the Lateran Treaty with Italy, creating a new independent state governed by the Holy See. The Vatican flag is modeled on the flag of the earlier Papal States.","infoTwo":"The flag consists of two vertical bands, one of gold or yellow (hoist side) and one of white with the crossed keys of Saint Peter and the Papal Tiara centered in the white band. The crossed keys consist of a golden and a silver key, in which the silver key is placed in the dexter position. The flag is one of only two square country flags in the world, the other being the flag of Switzerland."},
{"continent":"North America","country":"Antigua and Barbuda","capital":"Saint Johns","info":"The national flag of Antigua and Barbuda was adopted on February 27, 1967, and was designed by a nationally acclaimed artist and sculptor, Sir Reginald Samuel. The flag dates from the achievement of self-government in 1967. It was the winning design in a competition that more than 600 local people entered. The designer and winner was Sir Reginald Samuel.","infoTwo":"The rising sun symbolises the dawning of a new era. The colours have different meanings, the black is for the African ancestry of the people, the blue for hope, the red for energy or dynamism of the people. The successive colouring of yellow, blue, and white (from the sun down) also stands for the sun, sea, and sand. The blue also represents the Caribbean Sea, and the V-shape is the symbol of victory."},
{"continent":"North America","country":"Bahamas","capital":"Nassau","info":"The flag of the Bahamas consists of a black triangle situated at the hoist with three horizontal aquamarine, yellow and aquamarine bands. Adopted in 1973 to replace the British Blue Ensigndefaced with the emblem of theCrown Colony of the Bahama Islands, it has been the flag of the Commonwealth of the Bahamas since the country gained independence that year. The design of the present flag incorporated the elements of various submissions made in a national contest for a new flag prior to independence.","infoTwo":"The colours of the flag carry cultural, political, and regional meanings. The yellow alludes to the golden sand on the islands' beaches – as well as other key land-based natural resources – while the aquamarine epitomizes the sea surrounding the country (specifically the Caribbean Sea). The black symbolizes the "},
{"continent":"North America","country":"Barbados","capital":"Bridgetown","info":"The national flag of Barbados was officially adopted on 30 November 1966, the island's first Independence Day. It consists of a triband of two bands of ultramarine, which are said to stand for the ocean; separated by a golden middle band, representing the sand on the island. A black trident-head (commonly called the ","infoTwo":"The trident symbol was taken from Barbados'colonial badge, where the trident is shown with Britannia holding it. The broken lower part symbolises a symbolic break from its status as a colony.[1] The three points of the trident represent the three principles of democracy - 1) government of, 2) for, and 3) by the people."},
{"continent":"North America","country":"Belize","capital":"Belmopan","info":"The flag of Belize is a continued version of the earlier flag of British Honduras (the name of Belize during the British colonial period). The flag of Belize is the only country to have humans depicted as a major design element on its national flag, although the flag of Malta contains an image of Saint George on the badge of the George Cross, and the flags of British dependencies Montserrat and the Virgin Islands, and that of French Polynesia also depict humans.","infoTwo":"The colours on the flag are respectively those of the country's national parties, the People's United Party (PUP) and United Democratic Party (Belize) (UDP). The UDP, established in 1973, had objected to the original blue and white design, those two colours being the PUP's representative colours. The two red stripes at the top and bottom were added to the original design at independence. The coat of arms was granted in 1907. Red stripes were added to denote the colour of the opposition party. Blue is the party colour of the PUP (People's United Party. The 50 leaves recall 1950, the year PUP came to power."},
{"continent":"North America","country":"Canada","capital":"Ottawa","info":"The National Flag of Canada, also known as the Maple Leaf and l'Unifolié (French for ","infoTwo":"Elizabeth II, Queen of Canada, proclaimed the new flag on January 28, 1965, and it was inaugurated on February 15 of the same year at an official ceremony held on Parliament Hill in Ottawa, in the presence ofGovernor General Major-General Georges Vanier, the Prime Minister, other members of the Cabinet, and Canadian parliamentarians. The Red Ensign was lowered at the stroke of noon and the new maple leaf flag was raised. According to the documents edited by the Government of Canada: The flag is red and white, official colors that King George V designated for Canada in 1921."},
{"continent":"North America","country":"Costa Rica","capital":"San José","info":"The official flag of the Republic of Costa Rica is based on a design created in 1848. The flag was officially adopted on November 27, 1906, including a slight modification to the placement and design of the entrenched coat of arms. The flag was updated to reflect concurrent modifications to the national coat of arms in 1964 and 1998.","infoTwo":"The coat of arms depicts the isthmus between the Pacific ocean and the Caribbean Sea, with 3 volcanoes. The 7 stars stand for the 7 provinces of Costa Rica. The Spanish name of the country is scrolled on a white banner, Republica de Costa Rica (Republic of Costa Rica), and the Central American union is recognized in the blue upper scroll, America Central, recalling the former United Provinces of Central America."},
{"continent":"North America","country":"Cuba","capital":"Havana","info":"The flag of Cuba consists of five blue and white alternating stripes, and a red equilateral triangle at the hoist with a white 5-pointed star. It was adopted on June 25, 1848","infoTwo":"Anti-Spanish Cuban exiles under the leadership of Narciso López (a Venezuelan) adopted a flag suggested by the poet Miguel Teurbe Tolón (a Cuban). His design incorporates three blue stripes, representing the three parts that the country was divided during the independence wars, central, occidental, and oriental areas of the country, and two white stripes symbolizing the purity of the patriotic cause. The red triangle stands for the blood shed to free the nation, which is placed where the star is, symbolizing the sky turned red from the blood shed in battle. The white star in the masonic triangle stands for independence."},
{"continent":"North America","country":"Dominica","capital":"Roseau","info":"The flag of Dominica was adopted on November 3, 1978, with some small changes having been made in 1981, 1988, and 1990. The original flag was designed by playwright Alwin Bully in early 1978 as the country prepared for independence. The flag, adopted in 1978, features the national bird emblem, thesisserou parrot, which also appears on the coat of arms granted on 21 July 1961. This parrot, endemic to Dominica, is an endangered species with a population of only 250-350 individuals.","infoTwo":"The green field represents the lush vegetation of the island. The cross represents the Trinity and Christianity, with its three colours symbolising the native Indians, the fertile soil, and the pure water. The 10 stars stand for the country's 10 parishes: (St. Andrew, St. David, St. George, St. John, St. Joseph, St. Luke, St. Mark, St. Patrick, St. Paul, and St. Peter), while the red disc stands for social justice."},
{"continent":"North America","country":"Dominican Republic","capital":"Santo Domingo","info":"The flag of the Dominican Republic, as described by Article 21 of the Dominican Constitution, features a centered white cross that extends to the edges and divides the flag into four rectangles—the top ones are blue (hoist side) andred, and the bottom ones are red (hoist side) and blue. A large Coat of arms of the Dominican Republicfeaturing a shield with the flag design and supported by a bay laurel branch (left) and a palm frond (right) is at the center of the cross; above the shield, a blue ribbon displays the nationalmotto: Dios, Patria, Libertad(God, Fatherland, Liberty). Below the shield, the words República Dominicana appear on a red ribbon (this red ribbon is depicted in more recent versions as having its tips pointing upward). In the center of the shield, flanked by three spears (two of them holding Dominican banners) on each side, is a Biblewith a small cross above it and said to be opened to the Gospel of John, chapter 8, verse 32, which reads Y la verdad nos hará libre (And the truth shall make you free).","infoTwo":"The blue on the flag stands for liberty, the white for salvation, the red for the blood of heroes. The civil ensign follows the same design, but without the charge in the center. Tourists have sometimes been mistakenly told that the colors of the flag stand for beans, rice, and water - this is incorrect."},
{"continent":"North America","country":"El Salvador","capital":"San Salvador","info":"The flag of El Salvador was inspired by the flag of the Federal Republic of Central America, and by the flag of Argentina, the country that sent one of the first fleets to help consummate the independence of Central American republics from Spain.","infoTwo":"There are two versions of the flag, one containing the national coat of arms with the words REPUBLICA DE EL SALVADOR EN LA AMERICA CENTRAL (Spanish: Republic of El Salvador in Central America), and the other with the words DIOS UNION LIBERTAD (Spanish: God, Union, Liberty), both have the words in amber. The one bearing the coat of arms is used by the government and state organizations. The other version is used for civil purposes. Both contain the same lustrous vivid vibrant cobalt blue and white stripes and both flags have a 3:5 aspect ratio."},
{"continent":"North America","country":"Grenada","capital":"St. George's","info":"The national flag of Grenada was adopted upon independence from the United Kingdom, 7 February 1974. The six stars in the red border stand for the country's six parishes, with the middle star, encircled by a red disk, standing for the capital, Saint George's. The symbol in the hoistrepresents a clove ofnutmeg, one of the principal crops of Grenada. It also represents a link to Grenada's former name, which was the ","infoTwo":"The red colour of the flag stands for courage and vitality, yellow for wisdom and warmth, and green for vegetation and agriculture. The flag was designed by Anthony C. George of Soubise in Saint Andrew Parish."},
{"continent":"North America","country":"Guatemala","capital":"Guatemala City","info":"The flag of Guatemala features two colors: sky blue and white. The two sky blue stripes represent the fact that Guatemala is a land located between two oceans, the Pacific Oceanand the Atlantic Ocean (Caribbean sea); and the sky over the country. The white color signifies peace and purity.","infoTwo":"In the center of the flag is the Guatemalan coat of arms. It includes the Resplendent Quetzal, the national bird of Guatemala that symbolizes liberty; a parchment scroll bearing the date of Central America's independence from Spain, 15 September 1821; crossed rifles, indicating Guatemala's willingness to defend itself by force if need be; a bay laurel crown, the symbol for victory; and crossed swords, representing honor."},
{"continent":"North America","country":"Haiti","capital":"Port-au-prince","info":"The flag of Haiti is a bicolour flag featuring two horizonal bands coloured blue, and red, defaced by a white panel bearing thecoat of arms.","infoTwo":"The coat of arms depicts a trophy of weapons ready to defend freedom and a royal palm for independence. The palm is topped by the Cap of Liberty. The motto is on a white scroll reading L'Union Fait La Force ("},
{"continent":"North America","country":"Honduras","capital":"Tegucigalpa","info":"This national flag of Honduras was adopted on March 7, 1866, based on the flag of the Federal Republic of Central America. In 1823 Honduras joined the United Provinces of Central America and adopted their flag. In 1866 it was amended; five cerulean stars were placed in the center to represent the 5 original Central American provinces. The colors and pattern are the same as the flag of the United Provinces of Central America.","infoTwo":"The two outer cerulean bands represent the Pacific Ocean and the Caribbean Sea, and also represent the blue sky and brotherhood. The inner white band represents the land between the ocean and the sea, the peace and prosperity of its people, and purity of thoughts. The five cerulean five-pointed stars arranged in an X pattern centered in the white band represent the five nations of the former Federal Republic of Central America (El Salvador, Costa Rica, Nicaragua, Honduras, and Guatemala) and the hope that the nations may form a union again."},
{"continent":"North America","country":"Jamaica","capital":"Kingston","info":"The flag of Jamaica was adopted on August 6, 1962, the original Jamaican Independence Day, the country having gained independence from the British-protected Federation of the West Indies. The flag consists of a gold saltire, which divides the flag into four sections: two of them green (top and bottom) and two black (hoist and fly).","infoTwo":"The present design emerged from those sent in by the public in a national competition. It hints at the Scottish and Irish roots of much of the population, while black, green, and gold are Pan-African colors, representing the country's black majority population. An earlier interpretation of the colors was, "},
{"continent":"North America","country":"Mexico","capital":"Mexico City","info":"The flag of Mexico is a vertical tricolor of green, white, and red with the national coat of arms charged in the center of the white stripe. While the meaning of the colors has changed over time, these three colors were adopted by Mexico following independence from Spain during the country's War of Independence, and subsequent First Mexican Empire. The current flag was adopted in 1968, but the overall design has been used since 1821, when the First National Flag was created. The current law of national symbols, Law on the National Arms, Flag, and Anthem, that governs the use of thenational flag has been in place since 1984.","infoTwo":"Red, white, and green are the colors of the national liberation army in Mexico. The central emblem is the Aztec pictogram for Tenochtitlan (now Mexico City), the center of the Aztec empire. It recalls the legend that inspired the Aztecs to settle on what was originally a lake-island. The form of the coat of arms was most recently revised in 1968. A ribbon in the national colors is at the bottom of the coat of arms."},
{"continent":"North America","country":"Nicaragua","capital":"Managua","info":"The flag of Nicaragua was officially adopted on August 27, 1971 (first adopted on September 4, 1908). It is based on the flag of the Federal Republic of Central America and inspired by the Argentine flag. The presence of a rainbow in the coat of arms makes the flag of Nicaragua the only flag of a sovereign state to include the color violet. However, the flag of Dominica features a sisserou parrot which is often colored in purple.","infoTwo":"The triangle, volcanoes, rising sun, Cap of Liberty, and rainbow all appeared on the original emblem. The coat of arms used today contains the name of the state, Republica de Nicaragua, whereas in 1823 the title was Provincias Unidas del Centro de America. The decision to revert to the emblems used by the United Provinces of Central America was taken in 1908 and reflected Nicaragua's aspirations for the rebirth of the political entity formed by the 5 nations. Except for the text around the arms, the flag is very similar to that of the United Provinces of Central America. The 5 volcanoes represent the original 5 member states, the Cap of Liberty represents national freedom, and the rays of the sun and the rainbow are symbolic of the bright future."},
{"continent":"North America","country":"Panama","capital":"Panama City","info":"The flag of Panama was made by María de la Ossa de Amador and was officially adopted by the ","infoTwo":"The current Panamanian flag was made by María de la Ossa de Amador on November 1, 1903. The son of Manuel Amador Guerrero, generally recognized as a skillful drawer, sketched the flag and showed it to María de la Ossa de Amador, who, after much difficulty in avoiding the Colombian army, eventually produced three copies of the flag, which were all eventually flown in Panama City upon independence, and distributed widely. The stars and quarters are said to stand for the rival political parties, and the white for the peace in which they operate. Blue was the colour of the Conservatives, and red the colour of the Liberals."},
{"continent":"North America","country":"Saint Kitts and Nevis","capital":"Basseterre","info":"The flag of Saint Kitts and Nevis consists of a yellow-edged black band containing two white stars that divides diagonally from the lower hoist-side corner, with a green upper triangle and red lower triangle.","infoTwo":"The colors and symbols of the flag carry cultural, political, and regional meanings. The green alludes to the country's fertile land, while the red evokes the fight for freedom against slavery and colonialism. The yellow stripes represent the sunshine the islands enjoy all year round and the black epitomizes the people's African origins. The two stars on the black band symbolize Saint Christopher and Nevis—the two islands that make up the federation—as well as "},
{"continent":"North America","country":"Saint Lucia","capital":"Castries","info":"The flag of Saint Lucia consists of a light blue field charged with a yellow isosceles triangle in front of a white-edged black arrowhead. Adopted in 1967 to replace the British Blue Ensign defaced with the arms of the colony, it has been the flag of Saint Lucia since the country became an Associated State of the United Kingdom that year.","infoTwo":"The colours and symbols of the flag carry cultural, political, and regional meanings. The blue epitomizes the sky and the sea, specifically the Atlantic Ocean and Caribbean Sea which encircle the country. The black and white allude to the harmonious relationship between the two cultures that dominate the country, with the proportions accurately reflecting the ethnic composition of the island as people of African descent comprise 85.3% of the country's population. The yellow symbolizes the sunshine, as well as prosperity. The two triangles represent the Pitons, which are twin volcanic cones located in the southwest part of the island. Consisting of Gros Piton and Petit Piton, they are a national symbol of Saint Lucia."},
{"continent":"North America","country":"Saint Vincent and the Grenadines","capital":"Kingstown","info":"The flag of Saint Vincent and the Grenadines was adopted on October 21, 1985. It is composed of three vertical bands of blue, yellow and green (the yellow band forming a Canadian pale being half the width of the flag) with three diamonds centered in the yellow band and arranged in a V which stands for Vincent.","infoTwo":"These diamonds recall Saint Vincent as the "},
{"continent":"North America","country":"Trinidad and Tobago","capital":"Port Of Spain","info":"The flag of Trinidad and Tobagowas adopted upon independence from the United Kingdom on August 31, 1962. The flag was chosen by the independence committee of 1962. Red, black and white symbolize fire (the sun, representing courage), earth (representing dedication) and water (representing purity and equality).","infoTwo":"Prior to independence from the United Kingdom in August 1962, Trinidad and Tobago used a British blue ensign defaced with a circular badge depicting a ship arriving in front of a mountain."},
{"continent":"North America","country":"United States","capital":"Washington D.C.","info":"The national flag of the United States of America, often referred to as the American flag, consists of thirteen equal horizontal stripes of red (top and bottom) alternating with white, with a blue rectangle in the canton (referred to specifically as the ","infoTwo":"The 50 stars on the flag represent the 50 states of the United States of America and the 13 stripes represent the thirteen British colonies that declared independence from the Kingdom of Great Britain and became the first states in the Union. Nicknames for the flag include the "},
{"continent":"Oceania","country":"Australia","capital":"Canberra","info":"The flag of Australia is adefaced Blue Ensign: a blue field with the Union Jack in the canton (upper hoist quarter), and a large white seven-pointed star known as the Commonwealth Starin the lower hoist quarter. The fly contains a representation of the Southern Cross constellation, made up of five white stars – one small five-pointed star and four, larger, seven-pointed stars.","infoTwo":"The Southern Cross is one of the most distinctive constellations visible in the Southern Hemisphere, and has been used to represent Australia since the early days of British settlement. Ivor Evans, one of the flag's designers, intended the Southern Cross to refer also to the four moral virtues ascribed to the four main stars by Dante: justice, prudence, temperance and fortitude. The number of points on the stars of the Southern Cross on today's Australian flag differs from the original competition-winning design, on which they ranged between five and nine points each, representing their relative brightness in the night sky. The stars are named after the first five letters of the Greek alphabet, in decreasing order of brightness in the sky."},
{"continent":"Oceania","country":"Fiji","capital":"Suva","info":"The current flag ofFiji was adopted on 10 October 1970. The state arms have been slightly modified but the flag has remained the same as during the colonial period. It is a defaced sky-blue ","infoTwo":"The current flag is very similar to the colonial ensign used prior to independence, the main differences being the latter used a darker shade of blue and displayed the entire Fijian coat of arms as opposed to just the shield. While some reformists have called for the removal of theUnion Flag, seeing it a British colonial emblem, others support its retention for the sake of historical continuity. The flags of three other independent countries (Australia, New Zealand, and Tuvalu) currently retain the Union Flag in their national flags."},
{"continent":"Oceania","country":"Kiribati","capital":"Tarawa","info":"The flag of Kiribatiis red in the upper half with a gold frigate bird flying over a gold rising sun (otintaai), and the lower half is blue with three horizontal wavy white stripes to represent the ocean and the three groups (Gilbert, Phoenix and Line Islands). The 17 rays of the sun represent the 16 Gilbert Islands and Banaba (former Ocean Island).","infoTwo":"Shortly before independence was granted in 1979, a local competition was held to choose a new national flag, and a design based on the colonial coat of arms was submitted to the College of Arms. The College of Arms decided to modify this design. Both the golden frigatebird and the sun were enlarged to occupy more of the top of the flag, and the width of the blue and white wavy bands was reduced. The local people, however, insisted on the original design, in which the top and bottom halves of the flag were equal, the sun and local frigate bird small, and the various design elements outlined in black. The new flag was hoisted during the independence day celebrations in the capital, Tarawa, on July 12, 1979."},
{"continent":"Oceania","country":"Marshall Islands","capital":"Majuro","info":"The flag of the Marshall Islands, an island nation in the Pacific, was adopted upon the start of self-governance, May 1, 1979. The flag was designed by Emlain Kabua, who served as the first First Lady of the republic.","infoTwo":"In common with other island nations in the region, this flag features the symbolic representation of the islands' place within the ocean. A blue field with two stripes radiating from the lower hoist-side corner - orange (top) and white; a white star with four large rays and 20 small rays appears on the hoist side above the two stripes. The rising diagonal band represents the equator, the star above representing this Northern Hemispherearchipelago. The white and orange portions of the band represent, respectively, the Ratak Chain ("},
{"continent":"Oceania","country":"Micronesia","capital":"Palikir","info":"The flag of the Federated States of Micronesia (FSM) was adopted on 30 November 1978. The blue field represents the Pacific Ocean, while the four stars represent the states in the federation: Chuuk, Pohnpei, Kosrae and Yap.","infoTwo":"A similar design with six stars was in use from 1965 for the flag of the Trust Territory of the Pacific Islands. Kosrae was then part of Pohnpei so both were represented by one star. The three extra stars representing Palau, the Marshall Islands and Northern Mariana, which chose not to participate in the Federation. The flag, adopted in 1978, is in the colors of the UN flag. The light blue also represents the Pacific Ocean. In an echo of U.S. heraldic practice, the stars represent the entities that make up the state, in this case, the four islands, arranged like the points of the compass."},
{"continent":"Oceania","country":"Nauru","capital":"Yaren","info":"Following the indepencence of Nauru, the flag of Nauru was raised for the first time. The flag, chosen in a local design competition, was adopted on independence day, 31 January 1968.","infoTwo":"The flag depicts Nauru's geographical position, one degree below the Equator. A gold horizontal stripe representing the Equator runs across a blue field for the Pacific Ocean. Nauru itself is symbolized by a white 12-pointed star. Each point represents one of the 12 indigenous tribes on the island."},
{"continent":"Oceania","country":"New Zealand","capital":"Wellington","info":"The flag of New Zealand is a defaced Blue Ensign with the Union Flag in the canton, and four red stars with white borders to the right. The stars represent the constellation of Crux, the Southern Cross.","infoTwo":"After the formation of the colony in 1840, British ensigns began to be used. The current flag was designed and adopted for restricted use in 1869 and became the national flag in 1902."},
{"continent":"Oceania","country":"Palau","capital":"Ngerulmud","info":"The flag of Palau was adopted on 1 January 1981, when the island group separated from the United Nations Trust Territory.","infoTwo":"As with the flags of several other Pacific island groups, blue is the colour used to represent the ocean and the nation's place within it. While this puts Palau in common with the Federated States of Micronesia and other neighboring island groups, the disc on the flag (similar to that on Japan's flag) is off-centre like that of the flag of Bangladesh, but in this case represents the moon instead of the sun. The current flag was introduced in 1981 when Palau became a republic."},
{"continent":"Oceania","country":"Papua New Guinea","capital":"Port Moresby","info":"The flag of Papua New Guinea was adopted on July 1, 1971. In the hoist, it depicts the Southern Cross; in the fly, araggiana bird of paradise is silhouetted. The designer of the flag was 15-year-old schoolgirl Susan Huhume, who won a nationwide competition for a new flag design in 1971.","infoTwo":"Red and black have long been traditional colors of many Papua New Guinean tribes. Black-white-red was the color of the German Empire's flag, which had colonized New Guinea prior to 1918. The bird of paradise is also found on the national coat-of-arms."},
{"continent":"Oceania","country":"Samoa","capital":"Apia","info":"The flag of Samoa was first adopted from February 24, 1949 for UN Trusteeships, and continuously applied for the state's independence on January 1, 1962","infoTwo":"It consists of a red field with a blue rectangle in the canton. The blue rectangle bears the Southern Cross Constellation: four large white stars and one smaller star."},
{"continent":"Oceania","country":"Solomon Islands","capital":"Honiara","info":"The national flag of Solomon Islands was adopted officially on 18 November 1977. The result of official discussion and a design competition, the flag of the Solomons Islands was created in 1977 and adopted in the following year.","infoTwo":"The five main island groups are represented by the five stars. The blue is supposed to represent the surrounding ocean, while the green represents the land. The yellow stripe is symbolic of the sunshine."},
{"continent":"Oceania","country":"Tonga","capital":"Nuku'alofa","info":"The flag of Tonga consists of a red field with a white canton charged with a red couped cross. Adopted in 1875 after being officially enshrined into the nation's constitution, it has been the flag of the Kingdom of Tonga since that year. The constitution stipulates that the national flag can never be changed.","infoTwo":"The colours and symbols of the flag carry cultural, political, and regional meanings. The red couped cross alludes to Christianity, the religion practised by approximately 97% of the country's population. The white epitomises purity, while the red evokes the sacrifice of the Blood of Christ, which he shed during his Crucifixion."},
{"continent":"Oceania","country":"Tuvalu","capital":"Funafuti","info":"The current flag of Tuvalu was instated when the country became independent in 1978, after the separation from the Gilbert Islands in 1976.","infoTwo":"The name "},
{"continent":"Oceania","country":"Vanuatu","capital":"Port Vila","info":"The flag of Vanuatu was adopted on 18 February 1980. When the Vanua'aku Patiled the New Hebrides toindependence as Vanuatu in 1980, the colours of the party flag (red, green, black and yellow) were chosen to be the basis for the national flag. A parliamentary committee chose the final design based on submissions from local artists.","infoTwo":"The yellow symbolizes sunshine (peace and enlightenment brought by Christianity); the green the richness of the islands. The red is symbolic of blood (blood of sacrificed boars, power of traditions, and men's blood), and the black is for the Melanesian people. The Prime Minister requested the inclusion of yellow and black fimbriations to give more prominence to the colour representing the people. The yellow Y-shape denotes the pattern of the islands in the Pacific Ocean. The boar's tusk is a symbol of prosperity because (1) pigs are wealth (2) in the latter stages of getting the tusk to grow in a spiral the pig has to be hand fed, and you need status and wealth to have both the pig feeder and the food which are necessary."},
{"continent":"South America","country":"Argentina","capital":"Buenos Aires","info":"The national flag of Argentina is a triband, composed of three equally wide horizontal bands coloured light blue, and white. There are multiple interpretations on the reasons for those colors.","infoTwo":"Popular belief attributes the colors to those of the sky, clouds and the sun; some anthems to the flag like "},
{"continent":"South America","country":"Bolivia","capital":"Sucre","info":"The current flag o fBolivia was originally adopted in 1851. The state flag and ensign (and war flag) is a horizontal tricolor of red, yellow and green with the Bolivian coat of arms in the center.","infoTwo":"According to one source, the red stands for Bolivia's brave soldiers, while the green symbolizes fertility and yellow the nation's mineral deposits."},
{"continent":"South America","country":"Brazil","capital":"Brasília","info":"The national flag of Brazil is a blue disc depicting a starry sky spanned by a curved band inscribed with the national motto, within a yellow rhombus, on a green field. Brazil officially adopted this design for its national flag on November 19, 1889, replacing the flag of the Empire of Brazil.","infoTwo":"The green field and the yellow rhombus from the previous imperial flag were preserved – the green represented the House of Braganza of Dom Pedro I, the first Emperor of Brazil, while the yellow represented the House of Habsburgof his wife, Empress Maria Leopoldina. A blue circle with 27 white five-pointed stars replaced the arms of the Empire of Brazil. The stars, whose position in the flag reflect the sky over Rio de Janeiro on November 15, 1889, represent the union's federated units – each star representing a specific State, plus one for the Federal District."},
{"continent":"South America","country":"Chile","capital":"Santiago","info":"The national flag of Chile, consists of two unequal horizontal bands of white and red and a blue square the same height as the white band in thecanton, which bears a white five-pointed star in the center. It was adopted on 18 October 1817. The Chilean flag is also known in Spanish as La Estrella Solitaria (The Lone Star).","infoTwo":"The star may represent a guide to progress and honor while other interpretations refer to its reference to an independent state; blue symbolizes the sky and the Pacific Ocean, white is for the snow-covered Andes, and red stands for the blood spilled to achieve independence."},
{"continent":"South America","country":"Colombia","capital":"Bogotá","info":"The flag of Colombia was adopted on November 26, 1863. It is a horizontal tricolour of yellow, blue and red. The yellow stripe takes up the top half of the flag and the blue and red take up a quarter of the space each.","infoTwo":"The horizontal stripes (from top to bottom) of yellow, blue and red tricolour have a ratio of 2:1:1. It—together with that of Ecuador, also derived from the flag of Gran Colombia—is different from most other tricolour flags, either vertical or horizontal, in having stripes which are not equal in size."},
{"continent":"South America","country":"Ecuador","capital":"Quito","info":"The flag of Ecuador, which consists of horizontal bands of yellow (double width), blue and red, was first adopted on 1835 and later on September 26, 1860. The design of the current flag was finalized in 1900 with the addition of the coat of arms in the center of the flag.","infoTwo":"The design of the flag is very similar to those of Colombia and Venezuela, which are also former constituent territories of Gran Colombia. All three are based on a proposal by Venezuelan General Francisco de Miranda, which was adopted by Venezuela in 1811 and later Gran Colombia with some modifications."},
{"continent":"South America","country":"Guyana","capital":"Georgetown","info":"The flag of Guyana, known as The Golden Arrow, has been the national flag of Guyanasince May 1966 when the country became independent from theUnited Kingdom. It was designed by Whitney Smith, an Americanvexillologist (though originally without the black and white fimbriations, which were later additions suggested by the College of Arms in the United Kingdom).","infoTwo":"The colours are symbolic, with green for agriculture and forests, white for rivers and water, gold for mineral wealth, black for endurance, and red for zeal and dynamism."},
{"continent":"South America","country":"Paraguay","capital":"Asunción","info":"The flag of Paraguay(Spanish: bandera de Paraguay) was adopted in 1842. It is unusual because it differs on obverse and reverse sides. The only other national flags that share this feature are those of Moldova and Saudi Arabia however, both have a mirror image on the reverse, while Paraguay have a completely different image.","infoTwo":"Each side of the flag consists of three equal, horizontal bands: red, white, and blue, with an emblem centered in the white band. The emblem on the obverse side is the national coat of arms of Paraguay: a yellow five-pointed star surrounded by a green wreath capped by the words REPUBLICA DEL PARAGUAY ("},
{"continent":"South America","country":"Peru","capital":"Lima","info":"The flag of Peru was adopted by the government of Peru in 1825. It is a vertical triband with red outer bands and a single white middle band. Depending on its use, it may be defaced with different emblems, and has different names. Flag day in Peru is celebrated on June 7, the anniversary of the Battle of Arica.","infoTwo":"The Peruvian coat of armsincludes the vicuña (a relative of the llama andalpaca), the quina (cinchona) tree, and acornucopia of gold. Red represents the blood that was spilled for the fight for independence, and white represents peace and bravery."},
{"continent":"South America","country":"Suriname","capital":"Paramaribo","info":"The flag of Suriname is formed by five horizontal bands of green (top, double width), white, red (quadruple width), white, and green (double width). There is a large, yellow, five-pointed star centered in the red band.","infoTwo":"The flag was adopted on November 25, 1975, upon the independence of Suriname. The star represents the unity of all ethnic groups, the red stripe stands for progress and love, the green for hope and fertility, and the white bands for peace and justice."},
{"continent":"South America","country":"Uruguay","capital":"Montevideo","info":"The national flag of Uruguay has a field of nine equal horizontal stripes alternating white and blue. The cantonis white, charged with the Sun of May, from which 16 rays extend, alternating between triangular and wavy. The flag was first ADOPTED by law on December 16, 1828, and had 17 stripes until July 11, 1830, when a new law reduced the number of stripes to nine. The flag was designed by Joaquín Suárez.","infoTwo":"The horizontal stripes on the flag represent the nine originaldepartments of Uruguay. The first flag designed in 1828 had 9 light blue stripes; this number was reduced to 4 in 1830 before the proclamation of the country's first Constitution. The Sun of May represents a new nation in the world."},
{"continent":"South America","country":"Venezuela","capital":"Caracas","info":"The current flag of Venezuela was introduced in 2006. The basic design includes a horizontal tricolor of yellow, blue, and red, dating to the original flag introduced in 1811, in the Venezuelan War of Independence. Further modifications have involved including a set of stars, multiple changes to the placement and number of stars and inclusion of an optional coat of arms at the upper-left corner.","infoTwo":"In 2006 the President of Venezuela Hugo Chávez announced plans to add an eighth star to the flag of Venezuela to bring about a much belated fulfillment to Bolívar's 1817 decree. The eighth star represents the Guayana Province, one of the Provinces of Venezuela at the time of the declaration of independence. Although the new flag was approved by the Venezuelan government it has caused significant controversy, and at the time of its official unveiling, Óscar Pérez, a spokesperson for the opposition group National Resistance Command, stated that the opposition would not use the new flag."}
];